microresearch/allcolours/software/STM32F103/src/stm32f10x_it_DAC.c
#include "stm32f10x_it.h"
#include <stdlib.h>

/* 

These are the SR/PWM modes in interrupts...

List of Shift Register modes = CV and pulse driven:

List of PWM modes now:


- TODO: DAC modes:

 interpol 32-47 *CV)
 spacings 48-63 (pulse)


*/

#define SMOOTHINGS 512 // 128? we can hold 65536 of our 16 bit ADC values...

extern __IO uint16_t ADCBuffer[];
volatile uint32_t speedh, speedl, counterh=0, counter12h=0, counter12l=0,speedhh, speedll, counterl=0;
volatile uint32_t modelsr=0, modehsr=0, hcount=0, lcount=0; 
volatile uint8_t new_state[32], prev_state[32]={0}, flipped[32]={0}, new_statel[32], prev_statel[32]={0}, flippedl[32]={0}, probh, probl, togglel;
volatile uint8_t new_stath, prev_stath=0, flipdh=0, new_statl, prev_statl=0, flipdl=0, goinguph=1, goingupl=1;
volatile uint32_t shift_registerh=0xff; // 32 bit SR but we can change length just using output bit
volatile uint32_t shift_registerl=0xff; 
volatile uint32_t shift_registerx=0xff;
volatile uint32_t shift_registerxl=0xff;
volatile uint32_t hstack[4], lstack[4]; // length minus 1;
volatile uint32_t model, modeh; 
volatile uint32_t bith=0, bitl=0, inth=0, intl=0;
volatile uint32_t lastspeedhh, lastspeedll, lastmodeh=63, lastmodel=63;
volatile uint32_t targeth=8000<16, interh=1<<16, whereh=312<<16; // for interpol
volatile uint32_t targetl=8000<16, interl=1<<16, wherel=312<<16; // for interpol

// for new smoothings
uint32_t ll=0, totl=0, smoothl[SMOOTHINGS];
uint32_t hh=0, toth=0, smoothh[SMOOTHINGS];


void delay(unsigned long delay)
{
  while(delay) {
    delay--;
 asm("");
  }
}

void NMI_Handler(void)
{
}

void HardFault_Handler(void)
{
  /* Go to infinite loop when Hard Fault exception occurs */
  while (1)
  {
  }
}

void MemManage_Handler(void)
{
  /* Go to infinite loop when Memory Manage exception occurs */
  while (1)
  {
  }
}

void BusFault_Handler(void)
{
  /* Go to infinite loop when Bus Fault exception occurs */
  while (1)
  {
  }
}
void UsageFault_Handler(void)
{
  /* Go to infinite loop when Usage Fault exception occurs */
  while (1)
  {
  }
}
void SVC_Handler(void)
{
}

void DebugMon_Handler(void)
{
}

void PendSV_Handler(void)
{
}

void SysTick_Handler(void)
{
}

// for mode 13-electronotes = probh is not linear as we are interested in the number of bits set and not their position
// there are 8 positions which is 3 bits or we can make 16?
static uint32_t electroprob[8]={0, 3, 7, 15, 31, 63, 127, 255};

static uint32_t bits[8]={1, 2, 4, 8, 16, 32, 64, 128};

static uint32_t MASK[32]={4294967040, 4294967040, 4294967040, 4294967040, 4294967040, 4294967040, 4294967040, 4294967040, 4294966785, 4294966275, 4294965255, 4294963215, 4294959135, 4294950975, 4294934655, 4294902015, 4294836735, 4294706175, 4294445055, 4293922815, 4292878335, 4290789375, 4286611455, 4278255615, 4261543935, 4228120575, 4161273855, 4027580415, 3760193535, 3225419775, 2155872255, 16777215};

static uint32_t SHIFT[32]={0, 0, 0, 0, 0, 0, 0, 0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24}; 

// log_gen:     print("%s," % int(1+(((starter*xyz)-312)/32))),

static uint8_t bitsz[256]={0, 1, 1, 2, 1, 2, 2, 3, 1, 2, 2, 3, 2, 3, 3, 4, 1, 2, 2, 3, 2, 3, 3, 4, 2, 3, 3, 4, 3, 4, 4, 5, 1, 2, 2, 3, 2, 3, 3, 4, 2, 3, 3, 4, 3, 4, 4, 5, 2, 3, 3, 4, 3, 4, 4, 5, 3, 4, 4, 5, 4, 5, 5, 6, 1, 2, 2, 3, 2, 3, 3, 4, 2, 3, 3, 4, 3, 4, 4, 5, 2, 3, 3, 4, 3, 4, 4, 5, 3, 4, 4, 5, 4, 5, 5, 6, 2, 3, 3, 4, 3, 4, 4, 5, 3, 4, 4, 5, 4, 5, 5, 6, 3, 4, 4, 5, 4, 5, 5, 6, 4, 5, 5, 6, 5, 6, 6, 7, 1, 2, 2, 3, 2, 3, 3, 4, 2, 3, 3, 4, 3, 4, 4, 5, 2, 3, 3, 4, 3, 4, 4, 5, 3, 4, 4, 5, 4, 5, 5, 6, 2, 3, 3, 4, 3, 4, 4, 5, 3, 4, 4, 5, 4, 5, 5, 6, 3, 4, 4, 5, 4, 5, 5, 6, 4, 5, 5, 6, 5, 6, 6, 7, 2, 3, 3, 4, 3, 4, 4, 5, 3, 4, 4, 5, 4, 5, 5, 6, 3, 4, 4, 5, 4, 5, 5, 6, 4, 5, 5, 6, 5, 6, 6, 7, 3, 4, 4, 5, 4, 5, 5, 6, 4, 5, 5, 6, 5, 6, 6, 7, 4, 5, 5, 6, 5, 6, 6, 7, 5, 6, 6, 7, 6, 7, 7, 8};

static uint16_t logger[1024]={312, 313, 314, 315, 316, 317, 318, 319, 320, 321, 322, 323, 324, 326, 327, 328, 329, 330, 331, 332, 333, 334, 336, 337, 338, 339, 340, 341, 343, 344, 345, 346, 347, 348, 350, 351, 352, 353, 354, 356, 357, 358, 359, 360, 362, 363, 364, 365, 367, 368, 369, 370, 372, 373, 374, 375, 377, 378, 379, 380, 382, 383, 384, 386, 387, 388, 390, 391, 392, 394, 395, 396, 398, 399, 400, 402, 403, 404, 406, 407, 409, 410, 411, 413, 414, 416, 417, 418, 420, 421, 423, 424, 425, 427, 428, 430, 431, 433, 434, 436, 437, 439, 440, 442, 443, 445, 446, 448, 449, 451, 452, 454, 455, 457, 458, 460, 462, 463, 465, 466, 468, 469, 471, 473, 474, 476, 477, 479, 481, 482, 484, 486, 487, 489, 491, 492, 494, 496, 497, 499, 501, 502, 504, 506, 507, 509, 511, 513, 514, 516, 518, 520, 521, 523, 525, 527, 528, 530, 532, 534, 536, 538, 539, 541, 543, 545, 547, 549, 550, 552, 554, 556, 558, 560, 562, 564, 566, 567, 569, 571, 573, 575, 577, 579, 581, 583, 585, 587, 589, 591, 593, 595, 597, 599, 601, 603, 605, 607, 609, 611, 613, 616, 618, 620, 622, 624, 626, 628, 630, 632, 635, 637, 639, 641, 643, 645, 648, 650, 652, 654, 656, 659, 661, 663, 665, 668, 670, 672, 674, 677, 679, 681, 684, 686, 688, 691, 693, 695, 698, 700, 702, 705, 707, 710, 712, 714, 717, 719, 722, 724, 727, 729, 732, 734, 737, 739, 742, 744, 747, 749, 752, 754, 757, 759, 762, 765, 767, 770, 772, 775, 778, 780, 783, 786, 788, 791, 794, 796, 799, 802, 804, 807, 810, 813, 815, 818, 821, 824, 826, 829, 832, 835, 838, 841, 843, 846, 849, 852, 855, 858, 861, 864, 867, 870, 872, 875, 878, 881, 884, 887, 890, 893, 896, 899, 903, 906, 909, 912, 915, 918, 921, 924, 927, 930, 934, 937, 940, 943, 946, 950, 953, 956, 959, 962, 966, 969, 972, 976, 979, 982, 986, 989, 992, 996, 999, 1002, 1006, 1009, 1013, 1016, 1020, 1023, 1026, 1030, 1033, 1037, 1040, 1044, 1048, 1051, 1055, 1058, 1062, 1065, 1069, 1073, 1076, 1080, 1084, 1087, 1091, 1095, 1098, 1102, 1106, 1110, 1113, 1117, 1121, 1125, 1129, 1132, 1136, 1140, 1144, 1148, 1152, 1156, 1160, 1163, 1167, 1171, 1175, 1179, 1183, 1187, 1191, 1195, 1199, 1204, 1208, 1212, 1216, 1220, 1224, 1228, 1232, 1237, 1241, 1245, 1249, 1253, 1258, 1262, 1266, 1271, 1275, 1279, 1283, 1288, 1292, 1297, 1301, 1305, 1310, 1314, 1319, 1323, 1328, 1332, 1337, 1341, 1346, 1350, 1355, 1360, 1364, 1369, 1373, 1378, 1383, 1387, 1392, 1397, 1402, 1406, 1411, 1416, 1421, 1426, 1430, 1435, 1440, 1445, 1450, 1455, 1460, 1465, 1470, 1475, 1480, 1485, 1490, 1495, 1500, 1505, 1510, 1515, 1520, 1525, 1531, 1536, 1541, 1546, 1551, 1557, 1562, 1567, 1573, 1578, 1583, 1589, 1594, 1599, 1605, 1610, 1616, 1621, 1627, 1632, 1638, 1643, 1649, 1655, 1660, 1666, 1671, 1677, 1683, 1688, 1694, 1700, 1706, 1711, 1717, 1723, 1729, 1735, 1741, 1747, 1753, 1758, 1764, 1770, 1776, 1782, 1788, 1795, 1801, 1807, 1813, 1819, 1825, 1831, 1838, 1844, 1850, 1856, 1863, 1869, 1875, 1882, 1888, 1894, 1901, 1907, 1914, 1920, 1927, 1933, 1940, 1946, 1953, 1960, 1966, 1973, 1980, 1986, 1993, 2000, 2007, 2013, 2020, 2027, 2034, 2041, 2048, 2055, 2062, 2069, 2076, 2083, 2090, 2097, 2104, 2111, 2118, 2126, 2133, 2140, 2147, 2155, 2162, 2169, 2177, 2184, 2191, 2199, 2206, 2214, 2221, 2229, 2236, 2244, 2251, 2259, 2267, 2274, 2282, 2290, 2298, 2305, 2313, 2321, 2329, 2337, 2345, 2353, 2361, 2369, 2377, 2385, 2393, 2401, 2409, 2417, 2426, 2434, 2442, 2450, 2459, 2467, 2475, 2484, 2492, 2501, 2509, 2518, 2526, 2535, 2543, 2552, 2561, 2569, 2578, 2587, 2595, 2604, 2613, 2622, 2631, 2640, 2649, 2658, 2667, 2676, 2685, 2694, 2703, 2712, 2721, 2731, 2740, 2749, 2759, 2768, 2777, 2787, 2796, 2806, 2815, 2825, 2834, 2844, 2853, 2863, 2873, 2883, 2892, 2902, 2912, 2922, 2932, 2942, 2952, 2962, 2972, 2982, 2992, 3002, 3012, 3023, 3033, 3043, 3053, 3064, 3074, 3085, 3095, 3105, 3116, 3127, 3137, 3148, 3158, 3169, 3180, 3191, 3202, 3212, 3223, 3234, 3245, 3256, 3267, 3278, 3289, 3301, 3312, 3323, 3334, 3346, 3357, 3368, 3380, 3391, 3403, 3414, 3426, 3437, 3449, 3461, 3472, 3484, 3496, 3508, 3520, 3532, 3544, 3556, 3568, 3580, 3592, 3604, 3616, 3629, 3641, 3653, 3666, 3678, 3691, 3703, 3716, 3728, 3741, 3754, 3766, 3779, 3792, 3805, 3818, 3831, 3844, 3857, 3870, 3883, 3896, 3909, 3923, 3936, 3949, 3963, 3976, 3989, 4003, 4017, 4030, 4044, 4058, 4071, 4085, 4099, 4113, 4127, 4141, 4155, 4169, 4183, 4197, 4211, 4226, 4240, 4254, 4269, 4283, 4298, 4312, 4327, 4342, 4356, 4371, 4386, 4401, 4416, 4431, 4446, 4461, 4476, 4491, 4506, 4522, 4537, 4552, 4568, 4583, 4599, 4615, 4630, 4646, 4662, 4677, 4693, 4709, 4725, 4741, 4757, 4773, 4790, 4806, 4822, 4838, 4855, 4871, 4888, 4904, 4921, 4938, 4954, 4971, 4988, 5005, 5022, 5039, 5056, 5073, 5090, 5108, 5125, 5142, 5160, 5177, 5195, 5213, 5230, 5248, 5266, 5284, 5301, 5319, 5337, 5356, 5374, 5392, 5410, 5429, 5447, 5465, 5484, 5503, 5521, 5540, 5559, 5578, 5597, 5615, 5635, 5654, 5673, 5692, 5711, 5731, 5750, 5770, 5789, 5809, 5829, 5848, 5868, 5888, 5908, 5928, 5948, 5968, 5988, 6009, 6029, 6050, 6070, 6091, 6111, 6132, 6153, 6174, 6195, 6216, 6237, 6258, 6279, 6300, 6322, 6343, 6365, 6386, 6408, 6430, 6451, 6473, 6495, 6517, 6539, 6562, 6584, 6606, 6629, 6651, 6674, 6696, 6719, 6742, 6765, 6787, 6810, 6834, 6857, 6880, 6903, 6927, 6950, 6974, 6997, 7021, 7045, 7069, 7093, 7117, 7141, 7165, 7189, 7214, 7238, 7263, 7287, 7312, 7337, 7362, 7387, 7412, 7437, 7462, 7487, 7513, 7538, 7564, 7590, 7615, 7641, 7667, 7693, 7719, 7745, 7772, 7798, 7824, 7851, 7877, 7904, 7931, 7958, 7985, 8012, 8039, 8066, 8094, 8121, 8149, 8176, 8204, 8232, 8260, 8288, 8316, 8344, 8372, 8401, 8429, 8458, 8486, 8515, 8544, 8573, 8602, 8631, 8661, 8690, 8719, 8749, 8779, 8808, 8838, 8868, 8898, 8928, 8959, 8989, 9020, 9050, 9081, 9112, 9142, 9173, 9205, 9236, 9267, 9299, 9330, 9362, 9393, 9425, 9457, 9489, 9521, 9554, 9586, 9619, 9651, 9684, 9717, 9750, 9783, 9816, 9849, 9883, 9916, 9950};


static uint16_t lf_logger[1024]={500, 501, 503, 505, 506, 508, 510, 511, 513, 515, 517, 518, 520, 522, 524, 526, 527, 529, 531, 533, 535, 536, 538, 540, 542, 544, 546, 547, 549, 551, 553, 555, 557, 559, 561, 562, 564, 566, 568, 570, 572, 574, 576, 578, 580, 582, 584, 586, 588, 590, 592, 594, 596, 598, 600, 602, 604, 606, 608, 610, 612, 614, 616, 618, 621, 623, 625, 627, 629, 631, 633, 635, 638, 640, 642, 644, 646, 649, 651, 653, 655, 657, 660, 662, 664, 666, 669, 671, 673, 675, 678, 680, 682, 685, 687, 689, 692, 694, 696, 699, 701, 703, 706, 708, 711, 713, 716, 718, 720, 723, 725, 728, 730, 733, 735, 738, 740, 743, 745, 748, 750, 753, 755, 758, 761, 763, 766, 768, 771, 774, 776, 779, 781, 784, 787, 789, 792, 795, 798, 800, 803, 806, 808, 811, 814, 817, 819, 822, 825, 828, 831, 833, 836, 839, 842, 845, 848, 851, 853, 856, 859, 862, 865, 868, 871, 874, 877, 880, 883, 886, 889, 892, 895, 898, 901, 904, 907, 910, 913, 916, 920, 923, 926, 929, 932, 935, 938, 942, 945, 948, 951, 954, 958, 961, 964, 968, 971, 974, 977, 981, 984, 987, 991, 994, 997, 1001, 1004, 1008, 1011, 1015, 1018, 1021, 1025, 1028, 1032, 1035, 1039, 1042, 1046, 1049, 1053, 1057, 1060, 1064, 1067, 1071, 1075, 1078, 1082, 1086, 1089, 1093, 1097, 1100, 1104, 1108, 1112, 1116, 1119, 1123, 1127, 1131, 1135, 1138, 1142, 1146, 1150, 1154, 1158, 1162, 1166, 1170, 1174, 1178, 1182, 1186, 1190, 1194, 1198, 1202, 1206, 1210, 1214, 1218, 1222, 1227, 1231, 1235, 1239, 1243, 1248, 1252, 1256, 1260, 1265, 1269, 1273, 1277, 1282, 1286, 1291, 1295, 1299, 1304, 1308, 1313, 1317, 1322, 1326, 1331, 1335, 1340, 1344, 1349, 1353, 1358, 1362, 1367, 1372, 1376, 1381, 1386, 1390, 1395, 1400, 1405, 1409, 1414, 1419, 1424, 1429, 1433, 1438, 1443, 1448, 1453, 1458, 1463, 1468, 1473, 1478, 1483, 1488, 1493, 1498, 1503, 1508, 1513, 1519, 1524, 1529, 1534, 1539, 1544, 1550, 1555, 1560, 1566, 1571, 1576, 1582, 1587, 1592, 1598, 1603, 1609, 1614, 1619, 1625, 1631, 1636, 1642, 1647, 1653, 1658, 1664, 1670, 1675, 1681, 1687, 1692, 1698, 1704, 1710, 1716, 1721, 1727, 1733, 1739, 1745, 1751, 1757, 1763, 1769, 1775, 1781, 1787, 1793, 1799, 1805, 1811, 1817, 1823, 1830, 1836, 1842, 1848, 1855, 1861, 1867, 1874, 1880, 1886, 1893, 1899, 1906, 1912, 1919, 1925, 1932, 1938, 1945, 1951, 1958, 1965, 1971, 1978, 1985, 1991, 1998, 2005, 2012, 2019, 2025, 2032, 2039, 2046, 2053, 2060, 2067, 2074, 2081, 2088, 2095, 2102, 2109, 2117, 2124, 2131, 2138, 2146, 2153, 2160, 2167, 2175, 2182, 2190, 2197, 2204, 2212, 2219, 2227, 2235, 2242, 2250, 2257, 2265, 2273, 2280, 2288, 2296, 2304, 2312, 2319, 2327, 2335, 2343, 2351, 2359, 2367, 2375, 2383, 2391, 2399, 2408, 2416, 2424, 2432, 2440, 2449, 2457, 2465, 2474, 2482, 2490, 2499, 2507, 2516, 2524, 2533, 2542, 2550, 2559, 2568, 2576, 2585, 2594, 2603, 2611, 2620, 2629, 2638, 2647, 2656, 2665, 2674, 2683, 2692, 2701, 2711, 2720, 2729, 2738, 2748, 2757, 2766, 2776, 2785, 2795, 2804, 2814, 2823, 2833, 2842, 2852, 2862, 2871, 2881, 2891, 2901, 2911, 2920, 2930, 2940, 2950, 2960, 2970, 2980, 2991, 3001, 3011, 3021, 3031, 3042, 3052, 3062, 3073, 3083, 3094, 3104, 3115, 3125, 3136, 3146, 3157, 3168, 3179, 3189, 3200, 3211, 3222, 3233, 3244, 3255, 3266, 3277, 3288, 3299, 3311, 3322, 3333, 3344, 3356, 3367, 3379, 3390, 3401, 3413, 3425, 3436, 3448, 3460, 3471, 3483, 3495, 3507, 3519, 3531, 3543, 3555, 3567, 3579, 3591, 3603, 3615, 3628, 3640, 3652, 3665, 3677, 3690, 3702, 3715, 3727, 3740, 3753, 3765, 3778, 3791, 3804, 3817, 3830, 3843, 3856, 3869, 3882, 3895, 3908, 3922, 3935, 3948, 3962, 3975, 3989, 4002, 4016, 4029, 4043, 4057, 4071, 4084, 4098, 4112, 4126, 4140, 4154, 4168, 4182, 4197, 4211, 4225, 4240, 4254, 4268, 4283, 4297, 4312, 4327, 4341, 4356, 4371, 4386, 4400, 4415, 4430, 4445, 4461, 4476, 4491, 4506, 4521, 4537, 4552, 4568, 4583, 4599, 4614, 4630, 4646, 4661, 4677, 4693, 4709, 4725, 4741, 4757, 4773, 4789, 4806, 4822, 4838, 4855, 4871, 4888, 4904, 4921, 4938, 4955, 4971, 4988, 5005, 5022, 5039, 5056, 5073, 5091, 5108, 5125, 5143, 5160, 5178, 5195, 5213, 5231, 5248, 5266, 5284, 5302, 5320, 5338, 5356, 5374, 5392, 5411, 5429, 5448, 5466, 5485, 5503, 5522, 5541, 5559, 5578, 5597, 5616, 5635, 5654, 5674, 5693, 5712, 5732, 5751, 5771, 5790, 5810, 5830, 5849, 5869, 5889, 5909, 5929, 5949, 5969, 5990, 6010, 6030, 6051, 6071, 6092, 6113, 6133, 6154, 6175, 6196, 6217, 6238, 6259, 6281, 6302, 6323, 6345, 6366, 6388, 6410, 6431, 6453, 6475, 6497, 6519, 6541, 6563, 6586, 6608, 6631, 6653, 6676, 6698, 6721, 6744, 6767, 6790, 6813, 6836, 6859, 6882, 6906, 6929, 6953, 6976, 7000, 7024, 7047, 7071, 7095, 7119, 7144, 7168, 7192, 7217, 7241, 7266, 7290, 7315, 7340, 7365, 7390, 7415, 7440, 7465, 7491, 7516, 7542, 7567, 7593, 7619, 7644, 7670, 7696, 7723, 7749, 7775, 7801, 7828, 7854, 7881, 7908, 7935, 7962, 7989, 8016, 8043, 8070, 8098, 8125, 8153, 8180, 8208, 8236, 8264, 8292, 8320, 8348, 8377, 8405, 8434, 8462, 8491, 8520, 8549, 8578, 8607, 8636, 8665, 8695, 8724, 8754, 8784, 8813, 8843, 8873, 8903, 8934, 8964, 8994, 9025, 9056, 9086, 9117, 9148, 9179, 9210, 9242, 9273, 9304, 9336, 9368, 9399, 9431, 9463, 9495, 9528, 9560, 9592, 9625, 9658, 9690, 9723, 9756, 9789, 9823, 9856, 9889, 9923, 9957, 9990, 10024, 10058, 10093, 10127, 10161, 10196, 10230, 10265, 10300, 10335, 10370, 10405, 10440, 10476, 10511, 10547, 10583, 10619, 10655, 10691, 10727, 10764, 10800, 10837, 10874, 10910, 10947, 10985, 11022, 11059, 11097, 11134, 11172, 11210, 11248, 11286, 11325, 11363, 11402, 11440, 11479, 11518, 11557, 11596, 11636, 11675, 11715, 11755, 11795, 11835, 11875, 11915, 11956, 11996, 12037, 12078, 12119, 12160, 12201, 12242, 12284, 12326, 12368, 12409, 12452, 12494, 12536, 12579, 12622, 12664, 12707, 12750, 12794, 12837, 12881, 12924, 12968, 13012, 13056, 13101, 13145, 13190, 13235, 13279, 13325, 13370, 13415, 13461, 13506, 13552, 13598, 13644, 13691, 13737, 13784, 13831, 13877, 13925, 13972, 14019, 14067, 14115, 14162, 14210, 14259, 14307, 14356, 14404, 14453, 14502, 14552, 14601, 14650, 14700, 14750, 14800, 14850, 14901, 14951, 15002, 15053, 15104, 15155, 15207, 15258, 15310, 15362, 15414, 15467, 15519, 15572, 15625, 15678, 15731, 15784, 15838, 15891, 15945, 16000};

