microresearch/allcolours/software/STM32F103/src/stm32f10x_it_DAC.c
// logforSR could be a lot slower at one end - test/generate this! 2^14

static uint32_t slower_even_logforSR[1024]={0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 8, 8, 8, 8, 8, 8, 8, 8, 8, 9, 9, 9, 9, 9, 9, 9, 9, 9, 10, 10, 10, 10, 10, 10, 10, 11, 11, 11, 11, 11, 11, 11, 12, 12, 12, 12, 12, 12, 12, 13, 13, 13, 13, 13, 13, 14, 14, 14, 14, 14, 15, 15, 15, 15, 15, 16, 16, 16, 16, 16, 17, 17, 17, 17, 17, 18, 18, 18, 18, 18, 19, 19, 19, 19, 20, 20, 20, 20, 21, 21, 21, 21, 22, 22, 22, 23, 23, 23, 23, 24, 24, 24, 25, 25, 25, 25, 26, 26, 26, 27, 27, 27, 28, 28, 28, 29, 29, 29, 30, 30, 31, 31, 31, 32, 32, 32, 33, 33, 34, 34, 34, 35, 35, 36, 36, 37, 37, 37, 38, 38, 39, 39, 40, 40, 41, 41, 42, 42, 43, 43, 44, 44, 45, 45, 46, 46, 47, 48, 48, 49, 49, 50, 50, 51, 52, 52, 53, 54, 54, 55, 55, 56, 57, 58, 58, 59, 60, 60, 61, 62, 62, 63, 64, 65, 65, 66, 67, 68, 69, 69, 70, 71, 72, 73, 74, 75, 75, 76, 77, 78, 79, 80, 81, 82, 83, 84, 85, 86, 87, 88, 89, 90, 91, 92, 93, 94, 95, 96, 98, 99, 100, 101, 102, 103, 105, 106, 107, 108, 110, 111, 112, 114, 115, 116, 118, 119, 120, 122, 123, 125, 126, 128, 129, 131, 132, 134, 135, 137, 138, 140, 142, 143, 145, 147, 148, 150, 152, 154, 156, 157, 159, 161, 163, 165, 167, 169, 171, 173, 175, 177, 179, 181, 183, 185, 187, 190, 192, 194, 196, 199, 201, 203, 206, 208, 210, 213, 215, 218, 220, 223, 226, 228, 231, 234, 236, 239, 242, 245, 247, 250, 253, 256, 259, 262, 265, 268, 272, 275, 278, 281, 284, 288, 291, 294, 298, 301, 305, 308, 312, 316, 319, 323, 327, 331, 334, 338, 342, 346, 350, 354, 358, 363, 367, 371, 375, 380, 384, 389, 393, 398, 402, 407, 412, 417, 421, 426, 431, 436, 441, 447, 452, 457, 462, 468, 473, 479, 484, 490, 495, 501, 507, 513, 519, 525, 531, 537, 543, 550, 556, 563, 569, 576, 582, 589, 596, 603, 610, 617, 624, 631, 639, 646, 654, 661, 669, 677, 685, 693, 701, 709, 717, 725, 734, 742, 751, 760, 768, 777, 786, 795, 805, 814, 823, 833, 843, 852, 862, 872, 882, 893, 903, 914, 924, 935, 946, 957, 968, 979, 990, 1002, 1014, 1025, 1037, 1049, 1061, 1074, 1086, 1099, 1111, 1124, 1137, 1151, 1164, 1177, 1191, 1205, 1219, 1233, 1247, 1262, 1276, 1291, 1306, 1321, 1337, 1352, 1368, 1384, 1400, 1416, 1432, 1449, 1466, 1483, 1500, 1518, 1535, 1553, 1571, 1589, 1608, 1626, 1645, 1664, 1683, 1703, 1723, 1743, 1763, 1783, 1804, 1825, 1846, 1867, 1889, 1911, 1933, 1956, 1978, 2001, 2024, 2048, 2072, 2096, 2120, 2145, 2169, 2195, 2220, 2246, 2272, 2298, 2325, 2352, 2379, 2407, 2434, 2463, 2491, 2520, 2549, 2579, 2609, 2639, 2670, 2700, 2732, 2763, 2795, 2828, 2861, 2894, 2927, 2961, 2996, 3030, 3065, 3101, 3137, 3173, 3210, 3247, 3285, 3323, 3362, 3400, 3440, 3480, 3520, 3561, 3602, 3644, 3686, 3729, 3772, 3816, 3860, 3905, 3950, 3996, 4042, 4089, 4136, 4184, 4233, 4282, 4331, 4382, 4432, 4484, 4536, 4588, 4641, 4695, 4750, 4805, 4860, 4917, 4974, 5031, 5090, 5149, 5208, 5269, 5330, 5391, 5454, 5517, 5581, 5646, 5711, 5777, 5844, 5912, 5981, 6050, 6120, 6191, 6263, 6335, 6409, 6483, 6558, 6634, 6711, 6789, 6867, 6947, 7027, 7109, 7191, 7275, 7359, 7444, 7530, 7618, 7706, 7795, 7885, 7977, 8069, 8163, 8257, 8353, 8450, 8548, 8647, 8747, 8848, 8951, 9055, 9160, 9266, 9373, 9482, 9591, 9703, 9815, 9929, 10044, 10160, 10278, 10397, 10517, 10639, 10763, 10887, 11013, 11141, 11270, 11401, 11533, 11666, 11802, 11938, 12077, 12217, 12358, 12501, 12646, 12793, 12941, 13091, 13243, 13396, 13551, 13708, 13867, 14028, 14190, 14355, 14521, 14689, 14859, 15032, 15206, 15382, 15560, 15740, 15923, 16107, 16294, 16483, 16674, 16867, 17062, 17260, 17460, 17662, 17867, 18074, 18283, 18495, 18709, 18926, 19145, 19367, 19592, 19819, 20048, 20281, 20516, 20753, 20994, 21237, 21483, 21732, 21984, 22238, 22496, 22757, 23020, 23287, 23557, 23830, 24106, 24385, 24668, 24953, 25243, 25535, 25831, 26130, 26433, 26739, 27049, 27362, 27679, 28000, 28324, 28653, 28985, 29320, 29660, 30004, 30351, 30703, 31059, 31418, 31782, 32151, 32523, 32900, 33281, 33667, 34057, 34451, 34851, 35254, 35663, 36076, 36494, 36917, 37344, 37777, 38215, 38657, 39105, 39558, 40017, 40480, 40949, 41424, 41904, 42389, 42880, 43377, 43880, 44388, 44902, 45422, 45949, 46481, 47019, 47564, 48115, 48673, 49237, 49807, 50384, 50968, 51558, 52156, 52760, 53371, 53989, 54615, 55248, 55888, 56535, 57190, 57853, 58523, 59201, 59887, 60581, 61283, 61993, 62711, 63437, 64172, 64916, 65668, 66429, 67198, 67977, 68764, 69561, 70367, 71182, 72007, 72841, 73685, 74539, 75402, 76276, 77159, 78053, 78958, 79872, 80798, 81734, 82681, 83639, 84608, 85588, 86579, 87582, 88597, 89623, 90662, 91712, 92775, 93849, 94937, 96037, 97149, 98275, 99413, 100565, 101730, 102909, 104101, 105307, 106527, 107761, 109010, 110272, 111550, 112842, 114150, 115472, 116810, 118163, 119532, 120917, 122318, 123735, 125168, 126619, 128085, 129569, 131071};


// array for taps
// eg. 32-bit Galois LFSR with taps at 32, 30, 26, 25. Sequence length is 4294967295. 0 is a lock-up state.  -- minus one here - 31, 29, 25, 24
// bith= ((shift_registerh >> 31) ^ (shift_registerh >> 29) ^ (shift_registerh >> 25) ^ (shift_registerh >> 24)) & 1u; // 32 is 31, 29, 25, 24

// from: http://courses.cse.tamu.edu/walker/csce680/lfsr_table.pdf
// and reworked for length in test.c -> not so if we revert to basic code...

// note that we can have 2 mirrored with [n, A, B, C] -> [n, n-C, n-B, n-A] - maybe for LF to hF!

static uint8_t lfsr_taps[32][4] = {
        {0, 0, 0, 0},
        {0, 0, 0, 0},
        {0, 0, 0, 0},
        {3, 2, 0, 0},
        {4, 3, 2, 1},
        {5, 4, 2, 1},
        {6, 5, 4, 3},
        {7, 5, 4, 3},
        {8, 7, 5, 4},
        {9, 8, 6, 5},
        {10, 9, 8, 6},
        {11, 10, 7, 5},
        {12, 11, 9, 8},
        {13, 12, 10, 8},
        {14, 13, 12, 10},
        {15, 13, 12, 10},
        {16, 15, 14, 13},
        {17, 16, 15, 12},
        {18, 17, 16, 13},
        {19, 18, 15, 13},
        {20, 19, 18, 15},
        {21, 18, 17, 16},
        {22, 21, 19, 17},
        {23, 22, 20, 19},
        {24, 23, 22, 21},
        {25, 24, 23, 19},
        {26, 25, 24, 21},
        {27, 26, 23, 21},
        {28, 27, 26, 24},
        {29, 28, 25, 23},
        {30, 29, 28, 27},
        {31, 29, 25, 24},
  };

