microresearch/allcolours/software/STM32F103/src/stm32f10x_it_DAC.c
    case 2: 
	//->>>>>>>>>>>>>> 1- pulse (PB5) toggles loopback to XOR with new input bit (PB6) /or just accept new input bit (CGS)
	bitl = (shift_registerl>>31) & 0x01; // bit which would be shifted out -
    
	if (GPIOB->IDR & 0x0020) shift_registerl = (shift_registerl<<1) + (!(GPIOB->IDR & 0x0040));
	else shift_registerl = (shift_registerl<<1) + ((bitl ^ !(GPIOB->IDR & 0x0040)));

	// for divide down
	new_statl=(shift_registerl & (1<<15))>>15; // so that is not just a simple divide down
	if (prev_statl==0 && new_statl==1) flipdl^=1;
	prev_statl=new_statl;	
	if (flipdl) GPIOB->BRR = 0b0010000000000000;  
	else GPIOB->BSRR = 0b0010000000000000;
	if (bitl) GPIOB->BRR = 0b0100000000000000;   // this is top one!
	else GPIOB->BSRR = 0b0100000000000000;
	break;
    
      case 3: 
	//->>>>>>>>>>>>>> 2- loopback ORed with input bit and pulses flip/leak bits INSIDE the SR selected with counter and pulse
	lcount++;
	if (lcount>31) lcount=0;
	bitl = (shift_registerl>>31) & 0x01; // bit which would be shifted out 

	shift_registerl= (shift_registerl<<1) + (bitl ^ !(GPIOB->IDR & 0x0040));

	//	if( !(GPIOB->IDR & 0x0020))	  shift_registerl &= (1<<lcount); // if we have pulse and lcount then flip that bit inside SR... rest all the same...
	if( !(GPIOB->IDR & 0x0020)) shift_registerxl ^= (1<<lcount); // if we have pulse and lcount then flip that bit inside SR... rest all the same...
	shift_registerl ^= shift_registerxl;

	// for divide down
	new_statl=(shift_registerl & (1<<15))>>15; // so that is not just a simple divide down
	if (prev_statl==0 && new_statl==1) flipdl^=1;
	prev_statl=new_statl;	
	if (flipdl) GPIOB->BRR = 0b0010000000000000;  
	else GPIOB->BSRR = 0b0010000000000000;
	if (bitl) GPIOB->BRR = 0b0100000000000000;   // this is top one!
	else GPIOB->BSRR = 0b0100000000000000;
 	
	break;
    
      case 4: //* 
	//->>>>>>>>>>>>>> 3- pulse(1) inverts the cycling bit in - this is Turing Machine - cycle bit or invert bit (**no extra input bit is used)
	bitl = (shift_registerl>>31) & 0x01; // bit which would be shifted out 
	if (GPIOB->IDR & 0x0020) shift_registerl = (shift_registerl<<1) + bitl;
	else shift_registerl = (shift_registerl<<1) + (!bitl);

	// for divide down
	new_statl=(shift_registerl & (1<<15))>>15; // so that is not just a simple divide down
	if (prev_statl==0 && new_statl==1) flipdl^=1;
	prev_statl=new_statl;	
	if (flipdl) GPIOB->BRR = 0b0010000000000000;  
	else GPIOB->BSRR = 0b0010000000000000;
	if (bitl) GPIOB->BRR = 0b0100000000000000;   // this is top one!
	else GPIOB->BSRR = 0b0100000000000000;

	break;

      case 5: 
	//->>>>>>>>>>>>>> 4- parity for loopback XOR is determined by pulsed bits in -> select bits with pulse and queue 
	lcount++;
	if (lcount>31) lcount=0;
	if( !(GPIOB->IDR & 0x0020)) {
	  lstack[3]=lstack[2];
	  lstack[2]=lstack[1];
	  lstack[1]=lstack[0];
	  lstack[0]=lcount+1; // bump it on to the lstack
	}	  

	bitl= ((shift_registerl >> lstack[0]) ^ (shift_registerl >> lstack[1]) ^ (shift_registerl >> lstack[2]) ^ (shift_registerl >> lstack[3])) & 1u; // 32 is 31, 29, 25, 24
	shift_registerl= (shift_registerl<<1) + (bitl | !(GPIOB->IDR & 0x0040)); // TESTY - to OR in new bit or not?
	
	// for divide down
	new_statl=(shift_registerl & (1<<15))>>15; // so that is not just a simple divide down
	if (prev_statl==0 && new_statl==1) flipdl^=1;
	prev_statl=new_statl;	
	if (flipdl) GPIOB->BRR = 0b0010000000000000;  
	else GPIOB->BSRR = 0b0010000000000000;
	if (bitl) GPIOB->BRR = 0b0100000000000000;   // this is top one!
	else GPIOB->BSRR = 0b0100000000000000;

	break;

    case 6: // was 7
	//->>>>>>>>>>>>>> 7- electronotes: bits of the first SR determine (via NAND) if we recycle 2nd SR, or add new bit from the first SR - no input needed Q of lengths?
	// no use of in bit
	bitl = (shift_registerl>>31) & 0x01; // bit which would be shifted out -
	if (lcount>7) lcount=0;
	if( !(GPIOB->IDR & 0x0020)) probl^=(1<<lcount);
	lcount++;
	if (((probl | shift_registerh) & 0xff ) == 0xff) shift_registerl = (shift_registerl<<1) + ((shift_registerh>>31) & 0x01); // fixed for swop
	else shift_registerl = (shift_registerl<<1) + bitl;

	// for divide down
	new_statl=(shift_registerl & (1<<15))>>15; // so that is not just a simple divide down
	if (prev_statl==0 && new_statl==1) flipdl^=1;
	prev_statl=new_statl;	
	if (flipdl) GPIOB->BRR = 0b0010000000000000;  
	else GPIOB->BSRR = 0b0010000000000000;
	if (bitl) GPIOB->BRR = 0b0100000000000000;   // this is top one!
	else GPIOB->BSRR = 0b0100000000000000;
	break;

    case 7: // was 9
	// 9- LFSR noise only with varying taps depending on length with new bit ORed in depending on pulse - for LF we can do mirroring!
	if (shift_registerl==0) shift_registerl=0xff; // catch it!
	bitl= ((shift_registerl >> (lfsr_taps_mirrored[31][0])) ^ (shift_registerl >> (lfsr_taps_mirrored[31][1])) ^ (shift_registerl >> (lfsr_taps_mirrored[31][2])) ^ (shift_registerl >> (lfsr_taps_mirrored[31][3]))) & 1u; // 32 is 31, 29, 25, 24
	if (GPIOB->IDR & 0x0020) shift_registerl = (shift_registerl<<1) + bitl;
	else shift_registerl = (shift_registerl<<1) + (bitl | !(GPIOB->IDR & 0x0040)); 

	// for divide down
	new_statl=(shift_registerl & (1<<15))>>15; // so that is not just a simple divide down
	if (prev_statl==0 && new_statl==1) flipdl^=1;
	prev_statl=new_statl;	
	if (flipdl) GPIOB->BRR = 0b0010000000000000;  
	else GPIOB->BSRR = 0b0010000000000000;
	if (bitl) GPIOB->BRR = 0b0100000000000000;   // this is top one!
	else GPIOB->BSRR = 0b0100000000000000;
	break;

    case 8: //was 23 -  experimental modes 23+ here and 32+ in pulses - TESTED/WORKING!
	// shifting the array of LFSR taps = ghost_tapsH on the high side
	// clock pulse shifts one selected by pulse 
	if (!(GPIOB->IDR & 0x0020)) lcount++;
	if (lcount>3) lcount=0;
	if (!(GPIOB->IDR & 0x0040)) {
	  ghost_tapsL[31][lcount+1]+=1;
	  ghost_tapsL[31][lcount+1]%=31;
	}
	
	if (shift_registerl==0) shift_registerl=0xff; // catch it!
	bitl= ((shift_registerl >> (ghost_tapsL[31][0])) ^ (shift_registerl >> (ghost_tapsL[31][1])) ^ (shift_registerl >> (ghost_tapsL[31][2])) ^ (shift_registerl >> (ghost_tapsL[31][3]))) & 1u; // 32 is 31, 29, 25, 24
	shift_registerl = (shift_registerl<<1) + bitl;

	// for divide down
	new_statl=(shift_registerl & (1<<15))>>15; // so that is not just a simple divide down
	if (prev_statl==0 && new_statl==1) flipdl^=1;
	prev_statl=new_statl;	
	if (flipdl) GPIOB->BRR = 0b0010000000000000;  
	else GPIOB->BSRR = 0b0010000000000000;
	if (bitl) GPIOB->BRR = 0b0100000000000000;   // this is top one!
	else GPIOB->BSRR = 0b0100000000000000;
	break;

    case 9: // was 30
	//->>>>>>>>>>>>>> 3- pulse(1) inverts the cycling bit in - this is Turing Machine - cycle bit or invert bit (**no extra input bit is used)-> our 3 options if we have a bit 0x0020
	bitl = (shift_registerl>>31) & 0x01; // bit which would be shifted out 
	if (GPIOB->IDR & 0x0040) shift_registerl = (shift_registerl<<1) + bitl;
	else shift_registerl = (shift_registerl<<1) + (!bitl);

	if (!(GPIOB->IDR & 0x0020)){
	// for divide down
	new_statl=(shift_registerl & (1<<15))>>15; // so that is not just a simple divide down
	if (prev_statl==0 && new_statl==1) flipdl^=1;
	prev_statl=new_statl;	
	if (flipdl) GPIOB->BRR = 0b0010000000000000;  
	else GPIOB->BSRR = 0b0010000000000000;
	if (bitl) GPIOB->BRR = 0b0100000000000000;   // this is top one!
	else GPIOB->BSRR = 0b0100000000000000;
	}
	break;

    case 10: // was 32
	// extra mode in which (both) pulse on is triggered by bitl but gated off by input bit or pulse - but do we need like a toggle?????
	//-BASE it on::: >>>>>>>>>>>>>> 3- pulse(1) inverts the cycling bit in - this is Turing Machine - cycle bit or invert bit (**no extra input bit is used)
	// - TESTED/WORKING!
	
	bitl = (shift_registerl>>31) & 0x01; // bit which would be shifted out 
	if (GPIOB->IDR & 0x0020) shift_registerl = (shift_registerl<<1) + bitl;
	else shift_registerl = (shift_registerl<<1) + (!bitl);

	// for divide down
	new_statl=(shift_registerl & (1<<15))>>15; // so that is not just a simple divide down
	if (prev_statl==0 && new_statl==1) flipdl^=1;
	prev_statl=new_statl;	
	if (flipdl) GPIOB->BRR = 0b0010000000000000;  
	else GPIOB->BSRR = 0b0010000000000000;
	if (bitl) GPIOB->BRR = 0b0100000000000000;   // this is top one!
	else GPIOB->BSRR = 0b0100000000000000;
	break;

