microresearch/allcolours/software/STM32F103/src/stm32f10x_it_DAC.c
      case 11: // was 33 - and invert the above
	// extra mode in which (both) pulse on is triggered by bitl but gated off by input bit or pulse - but do we need like a toggle?????
	//-BASE it on::: >>>>>>>>>>>>>> 3- pulse(1) inverts the cycling bit in - this is Turing Machine - cycle bit or invert bit (**no extra input bit is used)
	// - TESTED/WORKING!
	
	bitl = (shift_registerl>>31) & 0x01; // bit which would be shifted out 
	if (GPIOB->IDR & 0x0020) shift_registerl = (shift_registerl<<1) + bitl;
	else shift_registerl = (shift_registerl<<1) + (!bitl);

	// for divide down
	new_statl=(shift_registerl & (1<<15))>>15; // so that is not just a simple divide down
	if (prev_statl==0 && new_statl==1) flipdl^=1;
	prev_statl=new_statl;	
	if (flipdl) GPIOB->BRR = 0b0010000000000000;  
	else GPIOB->BSRR = 0b0010000000000000;
	if (bitl) GPIOB->BRR = 0b0100000000000000;   // this is top one!
	else GPIOB->BSRR = 0b0100000000000000;
	break;
	
    case 12: // was 34
	// extra modes use pulse or input bit as length of SR controller: see mode 42 below
	/// length thing	
	// - TESTED/WORKING!
	lcount++;
      if (lcount>31) lcount=4;
      if (!(GPIOB->IDR & 0x0020)) {
	SRlengthl=lcount;
	lengthbitl=(SRlengthl/2);
	}
      // as mode 3::::
      bitl = (shift_registerl>>SRlengthl) & 0x01; // bit which would be shifted out 
	if (GPIOB->IDR & 0x0040) shift_registerl = (shift_registerl<<1) + bitl;
	else shift_registerl = (shift_registerl<<1) + (!bitl);

	// for divide down
	new_statl=(shift_registerl & (1<<lengthbitl))>>lengthbitl; // so that is not just a simple divide down
	if (prev_statl==0 && new_statl==1) flipdl^=1;
	prev_statl=new_statl;	
	if (flipdl) GPIOB->BRR = 0b0010000000000000;  
	else GPIOB->BSRR = 0b0010000000000000;
	if (bitl) GPIOB->BRR = 0b0100000000000000;   // this is top one!
	else GPIOB->BSRR = 0b0100000000000000;
	break;
	
    case 13: // was 35
	// Independent LFSR clocking regular SR (only in CV as speed) - TESTED/WORKING!
	// can use input bit as length of either SR = here is regularSR
	// works well
	lcount++;
	if (lcount>31) lcount=4;
	if (!(GPIOB->IDR & 0x0020)) {
	  SRlengthl=lcount;
	  lengthbitl=(SRlengthl/2);
	}
	
	if (shift_registerxl==0) shift_registerxl=0xff; // catch it!
	//	bitl= ((shift_registerl >> (lfsr_taps_mirrored[SRlengthl][0])) ^ (shift_registerl >> (lfsr_taps_mirrored[SRlengthl][1])) ^ (shift_registerl >> (lfsr_taps_mirrored[SRlengthl][2])) ^ (shift_registerl >> (lfsr_taps_mirrored[SRlengthl][3]))) & 1u; // 32 is 31, 29, 25, 24
	bitl= ((shift_registerxl >> 31) ^ (shift_registerxl >> 29) ^ (shift_registerxl >> 25) ^ (shift_registerxl >> 24)) & 1u; // 32 is 31, 29, 25, 24
	shift_registerxl = (shift_registerxl<<1) + bitl; // could or with incoming as we don't use this TESTY: shift_registerxl = (shift_registerx<<1) + (bitl | !(GPIOB->IDR & 0x0040)); 

	if (bitl){ // calculate and output new bitl with case 3 Turing Machine:
	  bitl = (shift_registerl>>SRlengthl) & 0x01; // bit which would be shifted out 
	  if (GPIOB->IDR & 0x0040) shift_registerl = (shift_registerl<<1) + bitl;
	  else shift_registerl = (shift_registerl<<1) + (!bitl);

	// for divide down
	new_statl=(shift_registerl & (1<<lengthbitl))>>lengthbitl; // so that is not just a simple divide down
	if (prev_statl==0 && new_statl==1) flipdl^=1;
	prev_statl=new_statl;	
	if (flipdl) GPIOB->BRR = 0b0010000000000000;  
	else GPIOB->BSRR = 0b0010000000000000;
	if (bitl) GPIOB->BRR = 0b0100000000000000;   // this is top one!
	else GPIOB->BSRR = 0b0100000000000000;
	}
	break;

    case 14: // was 37
	// Independent LFSR clocking regular SR (only in CV as speed) - TESTED/WORKING!
	// with input bit or'ed in
	if (shift_registerxl==0) shift_registerxl=0xff; // catch it!
	//	bitl= ((shift_registerl >> (lfsr_taps_mirrored[SRlengthl][0])) ^ (shift_registerl >> (lfsr_taps_mirrored[SRlengthl][1])) ^ (shift_registerl >> (lfsr_taps_mirrored[SRlengthl][2])) ^ (shift_registerl >> (lfsr_taps_mirrored[SRlengthl][3]))) & 1u; // 32 is 31, 29, 25, 24
	bitl= ((shift_registerxl >> 31) ^ (shift_registerxl >> 29) ^ (shift_registerxl >> 25) ^ (shift_registerxl >> 24)) & 1u; // 32 is 31, 29, 25, 24
	shift_registerxl = (shift_registerxl<<1) + (bitl | !(GPIOB->IDR & 0x0040)); 

	if (bitl){ // calculate and output new bitl with case 3 Turing Machine:

	  bitl = (shift_registerl>>31) & 0x01; // bit which would be shifted out 
	  if (GPIOB->IDR & 0x0020) shift_registerl = (shift_registerl<<1) + bitl;
	  else shift_registerl = (shift_registerl<<1) + (!bitl);
	  	
	// for divide down
	new_statl=(shift_registerl & (1<<15))>>15; // so that is not just a simple divide down
	if (prev_statl==0 && new_statl==1) flipdl^=1;
	prev_statl=new_statl;	
	if (flipdl) GPIOB->BRR = 0b0010000000000000;  
	else GPIOB->BSRR = 0b0010000000000000;
	if (bitl) GPIOB->BRR = 0b0100000000000000;   // this is top one!
	else GPIOB->BSRR = 0b0100000000000000;
	}
	break;

    case 15: // was 39
	// as above but LFSR?
	// working/.tested
      if (!(GPIOB->IDR & 0x0020)) togglel^=1; 

	if (togglel)
	  {
	    if (shift_registerl==0) shift_registerl=0xff; // catch it!
	    bitl= ((shift_registerl >> (lfsr_taps_mirrored[31][0])) ^ (shift_registerl >> (lfsr_taps_mirrored[31][1])) ^ (shift_registerl >> (lfsr_taps_mirrored[31][2])) ^ (shift_registerl >> (lfsr_taps_mirrored[31][3]))) & 1u; // 32 is 31, 29, 25, 24
	    shift_registerl = (shift_registerl<<1) + (bitl | !(GPIOB->IDR & 0x0040));  

	// for divide down
	new_statl=(shift_registerl & (1<<15))>>15; // so that is not just a simple divide down
	if (prev_statl==0 && new_statl==1) flipdl^=1;
	prev_statl=new_statl;	
	if (flipdl) GPIOB->BRR = 0b0010000000000000;  
	else GPIOB->BSRR = 0b0010000000000000;
	if (bitl) GPIOB->BRR = 0b0100000000000000;   // this is top one!
	else GPIOB->BSRR = 0b0100000000000000;	  }
	break;

	////////////////////////
	/// DAC modes LF side
	////////////////////////
	
    case 32:
      //->>>>>>>>>>>>>> 0- pulse (PB5) toggles loopback to OR with new input bit (PB6) /or just accept new input bit (CGS)
      bitl = (shift_registerl>>31) & 0x01; // bit which would be shifted out

      if (GPIOB->IDR & 0x0020) shift_registerl= (shift_registerl<<1) + (!(GPIOB->IDR & 0x0040)); // switched around for speed
      else shift_registerl = (shift_registerl<<1) + (bitl | !(GPIOB->IDR & 0x0040)); // PB5 and PB6

	// for divide down
	new_statl=(shift_registerl & (1<<15))>>15; // so that is not just a simple divide down
	if (prev_statl==0 && new_statl==1) flipdl^=1;
	prev_statl=new_statl;	
	if (flipdl) GPIOB->BRR = 0b0010000000000000;  
	else GPIOB->BSRR = 0b0010000000000000;
	if (bitl) GPIOB->BRR = 0b0100000000000000;   // this is top one!
	else GPIOB->BSRR = 0b0100000000000000;
	
