microresearch/allcolours/software/STM32F103/src/stm32f10x_it_DAC.c
	if (shift_registerxl==0) shift_registerxl=0xff; // catch it!
	//	bitl= ((shift_registerl >> (lfsr_taps_mirrored[SRlengthl][0])) ^ (shift_registerl >> (lfsr_taps_mirrored[SRlengthl][1])) ^ (shift_registerl >> (lfsr_taps_mirrored[SRlengthl][2])) ^ (shift_registerl >> (lfsr_taps_mirrored[SRlengthl][3]))) & 1u; // 32 is 31, 29, 25, 24
	bitl= ((shift_registerxl >> 31) ^ (shift_registerxl >> 29) ^ (shift_registerxl >> 25) ^ (shift_registerxl >> 24)) & 1u; // 32 is 31, 29, 25, 24
	shift_registerxl = (shift_registerxl<<1) + bitl; // could or with incoming as we don't use this TESTY: shift_registerxl = (shift_registerx<<1) + (bitl | !(GPIOB->IDR & 0x0040)); 

	if (bitl){ // calculate and output new bitl with case 3 Turing Machine:
	  bitl = (shift_registerl>>SRlengthl) & 0x01; // bit which would be shifted out 
	  if (GPIOB->IDR & 0x0040) shift_registerl = (shift_registerl<<1) + bitl;
	  else shift_registerl = (shift_registerl<<1) + (!bitl);

	// for divide down
	new_statl=(shift_registerl & (1<<lengthbitl))>>lengthbitl; // so that is not just a simple divide down
	if (prev_statl==0 && new_statl==1) flipdl^=1;
	prev_statl=new_statl;	
	if (flipdl) GPIOB->BRR = 0b0010000000000000;  
	else GPIOB->BSRR = 0b0010000000000000;
	if (bitl) GPIOB->BRR = 0b0100000000000000;   // this is top one!
	else GPIOB->BSRR = 0b0100000000000000;	
	}
	
	// interpol
	targetl=(4407-(shift_registerl&0x0FFF))<<16; // 4095+312 - 7ff = 2047+312= 2359
	if (wherel>=targetl) {
	  goingupl=0; // decrease
	  interl=(wherel-targetl)/(speedll+1); // and if goes down to 0 which will do as speedh maxes at 16383 - so
	}	  
	else {
	  goingupl=1; // increase
	  interl=(targetl-wherel)/(speedll+1); // and if goes down to 0 which will do as speedh maxes at 16383 - so
	}
	break;

    case 45: // was 37
	// Independent LFSR clocking regular SR (only in CV as speed) - TESTED/WORKING!
	// with input bit or'ed in
	if (shift_registerxl==0) shift_registerxl=0xff; // catch it!
	//	bitl= ((shift_registerl >> (lfsr_taps_mirrored[SRlengthl][0])) ^ (shift_registerl >> (lfsr_taps_mirrored[SRlengthl][1])) ^ (shift_registerl >> (lfsr_taps_mirrored[SRlengthl][2])) ^ (shift_registerl >> (lfsr_taps_mirrored[SRlengthl][3]))) & 1u; // 32 is 31, 29, 25, 24
	bitl= ((shift_registerxl >> 31) ^ (shift_registerxl >> 29) ^ (shift_registerxl >> 25) ^ (shift_registerxl >> 24)) & 1u; // 32 is 31, 29, 25, 24
	shift_registerxl = (shift_registerxl<<1) + (bitl | !(GPIOB->IDR & 0x0040)); 

	if (bitl){ // calculate and output new bitl with case 3 Turing Machine:

	  bitl = (shift_registerl>>31) & 0x01; // bit which would be shifted out 
	  if (GPIOB->IDR & 0x0020) shift_registerl = (shift_registerl<<1) + bitl;
	  else shift_registerl = (shift_registerl<<1) + (!bitl);
	  
	// for divide down
	new_statl=(shift_registerl & (1<<15))>>15; // so that is not just a simple divide down
	if (prev_statl==0 && new_statl==1) flipdl^=1;
	prev_statl=new_statl;	
	if (flipdl) GPIOB->BRR = 0b0010000000000000;  
	else GPIOB->BSRR = 0b0010000000000000;
	if (bitl) GPIOB->BRR = 0b0100000000000000;   // this is top one!
	else GPIOB->BSRR = 0b0100000000000000;	
	}
	
	// interpol
	targetl=(4407-(shift_registerl&0x0FFF))<<16; // 4095+312 - 7ff = 2047+312= 2359
	if (wherel>=targetl) {
	  goingupl=0; // decrease
	  interl=(wherel-targetl)/(speedll+1); // and if goes down to 0 which will do as speedh maxes at 16383 - so
	}	  
	else {
	  goingupl=1; // increase
	  interl=(targetl-wherel)/(speedll+1); // and if goes down to 0 which will do as speedh maxes at 16383 - so
	}
	break;

    case 46: // was 39
	// as above but LFSR?
      if (!(GPIOB->IDR & 0x0020)) togglel^=1; 

      if (togglel)
	  {
	    if (shift_registerl==0) shift_registerl=0xff; // catch it!
	    bitl= ((shift_registerl >> (lfsr_taps_mirrored[31][0])) ^ (shift_registerl >> (lfsr_taps_mirrored[31][1])) ^ (shift_registerl >> (lfsr_taps_mirrored[31][2])) ^ (shift_registerl >> (lfsr_taps_mirrored[31][3]))) & 1u; // 32 is 31, 29, 25, 24
	    shift_registerl = (shift_registerl<<1) + (bitl | !(GPIOB->IDR & 0x0040));  

	// for divide down
	new_statl=(shift_registerl & (1<<15))>>15; // so that is not just a simple divide down
	if (prev_statl==0 && new_statl==1) flipdl^=1;
	prev_statl=new_statl;	
	if (flipdl) GPIOB->BRR = 0b0010000000000000;  
	else GPIOB->BSRR = 0b0010000000000000;
	if (bitl) GPIOB->BRR = 0b0100000000000000;   // this is top one!
	else GPIOB->BSRR = 0b0100000000000000;	
	  }

	// interpol
	targetl=(4407-(shift_registerl&0x0FFF))<<16; // 4095+312 - 7ff = 2047+312= 2359
	if (wherel>=targetl) {
	  goingupl=0; // decrease
	  interl=(wherel-targetl)/(speedll+1); // and if goes down to 0 which will do as speedh maxes at 16383 - so
	}	  
	else {
	  goingupl=1; // increase
	  interl=(targetl-wherel)/(speedll+1); // and if goes down to 0 which will do as speedh maxes at 16383 - so
	}
	break;

    case 47: // test all replace 15 TESTY!
	// pulse in means we shift the logic operator
	if( !(GPIOB->IDR & 0x0020)) {
	lcount++;
	if (lcount>3) lcount=0;
	}
	
	bitl = (shift_registerl>>31) & 0x01; // bit which would be shifted out 

	// logic ops
	
	if (lcount==0) shift_registerl= (shift_registerl<<1) + !(bitl | !(GPIOB->IDR & 0x0040));
	else if (lcount==1) shift_registerl= (shift_registerl<<1) + (bitl ^ !(GPIOB->IDR & 0x0040));
	else if (lcount==2) shift_registerl= (shift_registerl<<1) + !(bitl ^ !(GPIOB->IDR & 0x0040));
	else shift_registerl= (shift_registerl<<1) + (bitl & !(GPIOB->IDR & 0x0040));

	// for divide down
	new_statl=(shift_registerl & (1<<15))>>15; // so that is not just a simple divide down
	if (prev_statl==0 && new_statl==1) flipdl^=1;
	prev_statl=new_statl;	
	if (flipdl) GPIOB->BRR = 0b0010000000000000;  
	else GPIOB->BSRR = 0b0010000000000000;
	if (bitl) GPIOB->BRR = 0b0100000000000000;   // this is top one!
	else GPIOB->BSRR = 0b0100000000000000;
	
	// interpol
	targetl=(8503-(shift_registerl&0x1FFF))<<16;
	if (wherel>=targetl) {
	  goingupl=0; // decrease
	  interl=(wherel-targetl)/(speedll+1); // and if goes down to 0 which will do as speedh maxes at 16383 - so
	}	  
	else {
	  goingupl=1; // increase
	  interl=(targetl-wherel)/(speedll+1); // and if goes down to 0 which will do as speedh maxes at 16383 - so
	}
	break;
	// /END of LF SR side/..................................................................................................................    
    }
    //  }
  }
  
  //..........................................
    ////////////////////////////////////////////->>>    /// high side
//  if (modehsr<32){

  counterh++;

  //  if (modehsr==0) { 
  //    speedhh= shift_registerl&0xfff;
    //  }
  
  if (counterh>speedhh){
      counterh=0;

      // *CV_HF: 0, 1, 2, 3, 4, 7, 9, 23, 25, 26, 28, 29, 34, 35, 36, 41*
      
      switch(modehsr){	 // SWITCH approach

      case 0: // speed controlled by other SR so we free up PULSE and CV - here CV-> length and pulse/toggles
      //->>>>>>>>>>>>>> CV selects length of SR  -> LFSR here
	speedhh= shift_registerl&0xfff;

