microresearch/allcolours/software/STM32F103/src/stm32f10x_it_DAC.c
	/*
      case 8: // was 23 --> experimental modes 23+ here and 32+ in pulses - TESTED/WORKING!
	// shifting the array of LFSR taps = ghost_tapsH on the high side
	// clock pulse shifts one selected by pulse 
	if (!(GPIOB->IDR & 0x0080)) hcount++;
	if (hcount>3) hcount=0;
	if (!(GPIOB->IDR & 0x0400)) {
	  ghost_tapsH[31][hcount+1]+=1;
	  ghost_tapsH[31][hcount+1]%=31;
	}
	
	if (shift_registerh==0) shift_registerh=0xff; // catch it!
	bith= ((shift_registerh >> (ghost_tapsH[31][0])) ^ (shift_registerh >> (ghost_tapsH[31][1])) ^ (shift_registerh >> (ghost_tapsH[31][2])) ^ (shift_registerh >> (ghost_tapsH[31][3]))) & 1u; // 32 is 31, 29, 25, 24
	shift_registerh = (shift_registerh<<1) + bith;
	
	// divide down
	new_stath=(shift_registerh & (1<<15))>>15; // so that is not just a simple divide down
	if (prev_stath==0 && new_stath==1) flipdh^=1;
	prev_stath=new_stath;	
	if (flipdh) GPIOC->BRR = 0b0010000000000000;  
	else GPIOC->BSRR = 0b0010000000000000;

	if (bith) GPIOC->BRR = 0b0100000000000000;   // this is top one!
	else GPIOC->BSRR = 0b0100000000000000;	
  	break;
	*/
      case 9: // was 25
	// SR loops within SR at certain points?/sizes determined by CV or pulses in = basic SR of OR with incoming bits - TESTED/WORKING!
	bith = (shift_registerh>>31) & 0x01; // bit which would be shifted out
	shift_registerh = (shift_registerh<<1) + (bith | (!(GPIOB->IDR & 0x0400)));
	// do the loop back in
	if( !(GPIOB->IDR & 0x0080)) hcount++;
	if (hcount>31) hcount=0;
	tmp = (shift_registerh>>hcount) & 0x01;
	// where to put that bit? XOR it with first bit
	if ( (shift_registerh & 0x01) ^ tmp) shift_registerh |= 0x01;// set the first bit
	else shift_registerh &= ~(0x01); // clear the first bit
	
	// divide down
	new_stath=(shift_registerh & (1<<15))>>15; // so that is not just a simple divide down
	if (prev_stath==0 && new_stath==1) flipdh^=1;
	prev_stath=new_stath;	
	if (flipdh) GPIOC->BRR = 0b0010000000000000;  
	else GPIOC->BSRR = 0b0010000000000000;

	if (bith) GPIOC->BRR = 0b0100000000000000;   // this is top one!
	else GPIOC->BSRR = 0b0100000000000000;	
	break;

      case 10: // was 26
	// Independent LFSR clocking regular SR (only in CV as speed) - TESTED/WORKING!
	// can use input bit as length of either SR
	// also can still use in clocking side of things
	// no use of input bit...
	if (shift_registerx==0) shift_registerx=0xff; // catch it!
	//	bith= ((shift_registerh >> (lfsr_taps[31][0])) ^ (shift_registerh >> (lfsr_taps[31][1])) ^ (shift_registerh >> (lfsr_taps[31][2])) ^ (shift_registerh >> (lfsr_taps[31][3]))) & 1u; // 32 is 31, 29, 25, 24
	bith= ((shift_registerx >> 31) ^ (shift_registerx >> 29) ^ (shift_registerx >> 25) ^ (shift_registerx >> 24)) & 1u; // 32 is 31, 29, 25, 24
	shift_registerx = (shift_registerx<<1) + bith; // could or with incoming as we don't use this TESTY: shift_registerx = (shift_registerx<<1) + (bith | !(GPIOB->IDR & 0x0400)); 

	if (bith){ // calculate and output new bith with case 3 Turing Machine:

	  bith = (shift_registerh>>31) & 0x01; // bit which would be shifted out 
	  if (GPIOB->IDR & 0x0080) shift_registerh = (shift_registerh<<1) + bith;
	  else shift_registerh = (shift_registerh<<1) + (!bith);

	// divide down
	new_stath=(shift_registerh & (1<<15))>>15; // so that is not just a simple divide down
	if (prev_stath==0 && new_stath==1) flipdh^=1;
	prev_stath=new_stath;	
	if (flipdh) GPIOC->BRR = 0b0010000000000000;  
	else GPIOC->BSRR = 0b0010000000000000;

	if (bith) GPIOC->BRR = 0b0100000000000000;   // this is top one!
	else GPIOC->BSRR = 0b0100000000000000;	
	}
	break;

      case 11: // was 28
	// Independent LFSR clocking regular SR (only in CV as speed) - as mode 26 but now we use 0x0080 bit also to see if we shift things...
	// no use of input bit... - TESTED/WORKING!
	if (shift_registerx==0) shift_registerx=0xff; // catch it!
	//	bith= ((shift_registerh >> (lfsr_taps[31][0])) ^ (shift_registerh >> (lfsr_taps[31][1])) ^ (shift_registerh >> (lfsr_taps[31][2])) ^ (shift_registerh >> (lfsr_taps[31][3]))) & 1u; // 32 is 31, 29, 25, 24
	bith= ((shift_registerx >> 31) ^ (shift_registerx >> 29) ^ (shift_registerx >> 25) ^ (shift_registerx >> 24)) & 1u; // 32 is 31, 29, 25, 24
	shift_registerx = (shift_registerx<<1) + bith; // could or with incoming as we don't use this TESTY: shift_registerx = (shift_registerx<<1) + (bith | !(GPIOB->IDR & 0x0400)); 

	if (bith && !(GPIOB->IDR & 0x0080) ){ // calculate and output new bith with case 3 Turing Machine:

	  bith = (shift_registerh>>31) & 0x01; // bit which would be shifted out 
	  if (GPIOB->IDR & 0x0400) shift_registerh = (shift_registerh<<1) + bith;
	  else shift_registerh = (shift_registerh<<1) + (!bith);

	  // divide down
	new_stath=(shift_registerh & (1<<15))>>15; // so that is not just a simple divide down
	if (prev_stath==0 && new_stath==1) flipdh^=1;
	prev_stath=new_stath;	
	if (flipdh) GPIOC->BRR = 0b0010000000000000;  
	else GPIOC->BSRR = 0b0010000000000000;

	if (bith) GPIOC->BRR = 0b0100000000000000;   // this is top one!
	else GPIOC->BSRR = 0b0100000000000000;	
	}
	break;

      case 12: // was 29
	//->>>>>>>>>>>>>> 3- pulse(1) inverts the cycling bit in - this is Turing Machine - cycle bit or invert bit (**no extra input bit is used)-> our 3 options if we have a bit 0x0080
	// - TESTED/WORKING!
	if (!(GPIOB->IDR & 0x0080)){
	bith = (shift_registerh>>31) & 0x01; // bit which would be shifted out 
	if (GPIOB->IDR & 0x0400) shift_registerh = (shift_registerh<<1) + bith;
	else shift_registerh = (shift_registerh<<1) + (!bith);

	// divide down
	new_stath=(shift_registerh & (1<<15))>>15; // so that is not just a simple divide down
	if (prev_stath==0 && new_stath==1) flipdh^=1;
	prev_stath=new_stath;	
	if (flipdh) GPIOC->BRR = 0b0010000000000000;  
	else GPIOC->BSRR = 0b0010000000000000;

	if (bith) GPIOC->BRR = 0b0100000000000000;   // this is top one!
	else GPIOC->BSRR = 0b0100000000000000;	
	}
	break;
	
      case 13: // was 35
	// Independent LFSR clocking regular SR (only in CV as speed) - TESTED/WORKING!
	// can use input bit as length of either SR = here is regularSR
	// works well
	hcount++;
	if (hcount>31) hcount=4;
	if (!(GPIOB->IDR & 0x0080)) {
	  SRlengthh=hcount;
	  lengthbith=(SRlengthh/2);
	}
	
