microresearch/allcolours/software/STM32F103/src/stm32f10x_it_DAC.c
	if (shift_registerx==0) shift_registerx=0xff; // catch it!
	//	bith= ((shift_registerh >> (lfsr_taps[SRlengthh][0])) ^ (shift_registerh >> (lfsr_taps[SRlengthh][1])) ^ (shift_registerh >> (lfsr_taps[SRlengthh][2])) ^ (shift_registerh >> (lfsr_taps[SRlengthh][3]))) & 1u; // 32 is 31, 29, 25, 24
	bith= ((shift_registerx >> 31) ^ (shift_registerx >> 29) ^ (shift_registerx >> 25) ^ (shift_registerx >> 24)) & 1u; // 32 is 31, 29, 25, 24
	shift_registerx = (shift_registerx<<1) + bith; // could or with incoming as we don't use this TESTY: shift_registerx = (shift_registerx<<1) + (bith | !(GPIOB->IDR & 0x0400)); 

	if (bith){ // calculate and output new bith with case 3 Turing Machine:
	  bith = (shift_registerh>>SRlengthh) & 0x01; // bit which would be shifted out 
	  if (GPIOB->IDR & 0x0400) shift_registerh = (shift_registerh<<1) + bith;
	  else shift_registerh = (shift_registerh<<1) + (!bith);

	// divide down
	new_stath=(shift_registerh & (1<<lengthbith))>>lengthbith; // so that is not just a simple divide down
	if (prev_stath==0 && new_stath==1) flipdh^=1;
	prev_stath=new_stath;	
	if (flipdh) GPIOC->BRR = 0b0010000000000000;  
	else GPIOC->BSRR = 0b0010000000000000;

	if (bith) GPIOC->BRR = 0b0100000000000000;   // this is top one!
	else GPIOC->BSRR = 0b0100000000000000;	
	}
	break;

      case 14: // was 36
	// Independent LFSR clocking regular SR (only in CV as speed) - TESTED/WORKING!
	// can use input bit as length of either SR = here is shift_regx
	// works ok not so interesting as 35
       	hcount++;
	if (hcount>31) hcount=4;
	if (!(GPIOB->IDR & 0x0080)) {
	  SRlengthx=hcount;
	}
	
	if (shift_registerx==0) shift_registerx=0xff; // catch it!
	bith= ((shift_registerx >> (lfsr_taps[SRlengthx][0])) ^ (shift_registerx >> (lfsr_taps[SRlengthx][1])) ^ (shift_registerx >> (lfsr_taps[SRlengthx][2])) ^ (shift_registerx >> (lfsr_taps[SRlengthx][3]))) & 1u; // 32 is 31, 29, 25, 24
	//	bith= ((shift_registerx >> 31) ^ (shift_registerx >> 29) ^ (shift_registerx >> 25) ^ (shift_registerx >> 24)) & 1u; // 32 is 31, 29, 25, 24
	shift_registerx = (shift_registerx<<1) + bith; // could or with incoming as we don't use this TESTY: shift_registerx = (shift_registerx<<1) + (bith | !(GPIOB->IDR & 0x0400)); 

	if (bith){ // calculate and output new bith with case 3 Turing Machine:
	  bith = (shift_registerh>>31) & 0x01; // bit which would be shifted out 
	  if (GPIOB->IDR & 0x0400) shift_registerh = (shift_registerh<<1) + bith;
	  else shift_registerh = (shift_registerh<<1) + (!bith);
	  
	// divide down
	new_stath=(shift_registerh & (1<<15))>>15; // so that is not just a simple divide down
	if (prev_stath==0 && new_stath==1) flipdh^=1;
	prev_stath=new_stath;	
	if (flipdh) GPIOC->BRR = 0b0010000000000000;  
	else GPIOC->BSRR = 0b0010000000000000;

	if (bith) GPIOC->BRR = 0b0100000000000000;   // this is top one!
	else GPIOC->BSRR = 0b0100000000000000;	
	  }
	break;
	
      case 15: // test all replace 15 TESTY!
	// pulse in means we shift the logic operator
	if( !(GPIOB->IDR & 0x0080)) {
	hcount++;
	if (hcount>3) hcount=0;
	}
	
	bith = (shift_registerh>>31) & 0x01; // bit which would be shifted out 

	// logic ops
	if (hcount==0) shift_registerh= (shift_registerh<<1) + !(bith | !(GPIOB->IDR & 0x0400));
	else if (hcount==1) shift_registerh= (shift_registerh<<1) + (bith ^ !(GPIOB->IDR & 0x0400));
	else if (hcount==2) shift_registerh= (shift_registerh<<1) + !(bith ^ !(GPIOB->IDR & 0x0400));
	else shift_registerh= (shift_registerh<<1) + (bith & !(GPIOB->IDR & 0x0400));
	
	// divide down
	new_stath=(shift_registerh & (1<<15))>>15; // so that is not just a simple divide down
	if (prev_stath==0 && new_stath==1) flipdh^=1;
	prev_stath=new_stath;	
	if (flipdh) GPIOC->BRR = 0b0010000000000000;  
	else GPIOC->BSRR = 0b0010000000000000;

	if (bith) GPIOC->BRR = 0b0100000000000000;   // this is top one!
	else GPIOC->BSRR = 0b0100000000000000;	
	break;

	
	///////////////////
	// DAC modes HF side - interpol
	///////////////////
	//	/TODO:
      case 32:
	//->>>>>>>>>>>>>> 0- pulse clock in (PB7) toggles loopback to OR with new input bit (PB10) /or just accept new input bit (CGS)
	bith = (shift_registerh>>31) & 0x01; // bit which would be shifted out
	
	if (GPIOB->IDR & 0x0080) shift_registerh = (shift_registerh<<1) + (!(GPIOB->IDR & 0x0400)); // 0x0080 is clock bit in!
	else shift_registerh = (shift_registerh<<1) + (bith | (!(GPIOB->IDR & 0x0400))); 

	// divide down
	new_stath=(shift_registerh & (1<<15))>>15; // so that is not just a simple divide down
	if (prev_stath==0 && new_stath==1) flipdh^=1;
	prev_stath=new_stath;	
	if (flipdh) GPIOC->BRR = 0b0010000000000000;  
	else GPIOC->BSRR = 0b0010000000000000;

	if (bith) GPIOC->BRR = 0b0100000000000000;   // this is top one!
	else GPIOC->BSRR = 0b0100000000000000;	

	// INTERPOL TEST  - try this for every 12  or so bits - check logic for this!
	inth++;
	if (inth>11){ // 10 bits now
	  inth=0;
	  targeth=(2359-(shift_registerh&0x7FF))<<16;
	  // or 0x3ff for 10 bits = 312+1023 = 1335 
	  // or 0x7ff for 11 bits = 312+2047= 2359
	  // or 0xfff for 12 bits = 312+4095 = 4407
 	  // or 0x1fff for 13 bits = 312+8191=8503

	  if (whereh>=targeth) {
	  goinguph=0; // decrease
	  interh=(whereh-targeth)/(11*(speedhh+1)); // and if goes down to 0 which will do as speedh maxes at 16383 - so
	}	  
	else {
	  goinguph=1; // increase
	  interh=(targeth-whereh)/(11*(speedhh+1)); // and if goes down to 0 which will do as speedh maxes at 16383 - so
	}
	}
	break;

      case 33: 
	//->>>>>>>>>>>>>> 1- pulse (PB5) toggles loopback to XOR with new input bit (PB6) /or just accept new input bit (CGS)
	bith = (shift_registerh>>31) & 0x01; // bit which would be shifted out -
    
	if (GPIOB->IDR & 0x0080) shift_registerh = (shift_registerh<<1) + (!(GPIOB->IDR & 0x0400));
	else shift_registerh = (shift_registerh<<1) + ((bith ^ !(GPIOB->IDR & 0x0400)));

	// divide down
	new_stath=(shift_registerh & (1<<15))>>15; // so that is not just a simple divide down
	if (prev_stath==0 && new_stath==1) flipdh^=1;
	prev_stath=new_stath;	
	if (flipdh) GPIOC->BRR = 0b0010000000000000;  
	else GPIOC->BSRR = 0b0010000000000000;

	if (bith) GPIOC->BRR = 0b0100000000000000;   // this is top one!
	else GPIOC->BSRR = 0b0100000000000000;	

	// INTERPOL TEST
	targeth=(4407-(shift_registerh&0x0FFF))<<16;
	if (whereh>=targeth) {
	  goinguph=0; // decrease
	  interh=(whereh-targeth)/(speedhh+1); // and if goes down to 0 which will do as speedh maxes at 16383 - so
	}	  
	else {
	  goinguph=1; // increase
	  interh=(targeth-whereh)/(speedhh+1); // and if goes down to 0 which will do as speedh maxes at 16383 - so
	}
	break;
    
