microresearch/allcolours/software/STM32F103/src/stm32f10x_it_DAC.c
      }
      break;

        case 24: // was 45 to be replaced by case 62
      //->>>>>>>>>>>>>> entry into SR from CV - TM = no input bit = 3rd option of above...
      	// - TESTED/WORKING!
      lcount++;
      if (lcount>7) lcount=0;
	bitl = (shift_registerl>>31) & 0x01; // bit which would be shifted out
	if((ADCBuffer[3]>>(8+lcount))&1) shift_registerl = (shift_registerl<<1) + (!bitl); // or we could & with input bit - TO TEST!
	else shift_registerl = (shift_registerl<<1) + bitl;

	if (!(GPIOB->IDR & 0x0040)){
	// for divide down
	new_statl=(shift_registerl & (1<<15))>>15; // so that is not just a simple divide down
	if (prev_statl==0 && new_statl==1) flipdl^=1;
	prev_statl=new_statl;	
	if (flipdl) GPIOB->BRR = 0b0010000000000000;  
	else GPIOB->BSRR = 0b0010000000000000;
	if (bitl) GPIOB->BRR = 0b0100000000000000;   // this is top one!
	else GPIOB->BSRR = 0b0100000000000000;	
      }
	break;

    case 25: // was 47 - maybe replace
      // *we could use CV to set length of pulse (say up to 128 which is 7 bits >> 9)*
      //->>>>>>>>>>>>>> as mode 14=speed divider with XOR rungler: XOR out with input bit
      	// - TESTED/WORKING! - not so exciting ....
      bitl = (shift_registerl>>31) & 0x01; // bit which would be shifted out
      shift_registerl = (shift_registerl<<1) + ((bitl) ^ (!(GPIOB->IDR & 0x0040)));

	// for divide down
	new_statl=(shift_registerl & (1<<15))>>15; // so that is not just a simple divide down
	if (prev_statl==0 && new_statl==1) flipdl^=1;
	prev_statl=new_statl;	
	  
	if (flipdl) {
	  GPIOB->BRR = 0b0010000000000000; 
	  delay(ADCBuffer[3]>>9); // 64=10uS - short = lower voltage...
	  GPIOB->BSRR = 0b0010000000000000;  
	}
	  
	if (bitl) {
	  GPIOB->BRR = 0b0100000000000000;  
	  delay(ADCBuffer[3]>>9); // 64=10uS
	  GPIOB->BSRR = 0b0100000000000000;  
	  }
	break;
      
    case 26: // was 51
      //->>>>>>>>>>>>>> Electronotes: CV selects which bits to set to 1 = chance of change
      // TESTED/WORKING!
      bitl = (shift_registerl>>31) & 0x01; // bit which would be shifted out -
      probl=ADCBuffer[3]>>13; // 3 bits now for electroprob array
      probl=electroprob[probl];

      if (((probl | shift_registerh) & 0xff ) == 0xff) shift_registerl = (shift_registerl<<1) + ((shift_registerh>>31) & 0x01); 
      else shift_registerl = (shift_registerl<<1) + bitl;

      if (!(GPIOB->IDR & 0x0040)){

	// for divide down
	new_statl=(shift_registerl & (1<<15))>>15; // so that is not just a simple divide down
	if (prev_statl==0 && new_statl==1) flipdl^=1;
	prev_statl=new_statl;	
	if (flipdl) GPIOB->BRR = 0b0010000000000000;  
	else GPIOB->BSRR = 0b0010000000000000;
	if (bitl) GPIOB->BRR = 0b0100000000000000;   // this is top one!
	else GPIOB->BSRR = 0b0100000000000000;	
 

      }
      break;

    case 27: // was 52
      //->>>>>>>>>>>>>> Electronotes: CV selects which bits to set to 1 = chance of change
      // TESTED/WORKING!
      bitl=0;
      if (!(GPIOB->IDR & 0x0040)){
      bitl = (shift_registerl>>31) & 0x01; // bit which would be shifted out -
      probl=ADCBuffer[3]>>13; // 3 bits now for electroprob array
      probl=electroprob[probl];

      if (((probl | shift_registerh) & 0xff ) == 0xff) shift_registerl = (shift_registerl<<1) + ((shift_registerh>>31) & 0x01); 
      else shift_registerl = (shift_registerl<<1) + bitl;
      }
      
	// for divide down
	new_statl=(shift_registerl & (1<<15))>>15; // so that is not just a simple divide down
	if (prev_statl==0 && new_statl==1) flipdl^=1;
	prev_statl=new_statl;	
	if (flipdl) GPIOB->BRR = 0b0010000000000000;  
	else GPIOB->BSRR = 0b0010000000000000;
	if (bitl) GPIOB->BRR = 0b0100000000000000;   // this is top one!
	else GPIOB->BSRR = 0b0100000000000000;	
 
      break;

    case 28: // was 53
      // - after case 25 - SR loops within SR at certain points?/sizes determined by CV or pulses in = basic SR of OR with incoming bits
      // change and Re_test this - TESTED/working
      // loop bitl back in XOR at certain point?
	bitl = (shift_registerl>>31) & 0x01; // bit which would be shifted out
	shift_registerl = (shift_registerl<<1);
	// do the loop back in
	lcount=ADCBuffer[3]>>11; // 5 bits - or: lcount=(ADCBuffer[3]>>11)%(SRlengthl+1);
	if (bitl) shift_registerl ^= (1<<lcount);// set the xth bit
	shift_registerl ^= (!(GPIOB->IDR & 0x0040));
	
	// for divide down
	new_statl=(shift_registerl & (1<<15))>>15; // so that is not just a simple divide down
	if (prev_statl==0 && new_statl==1) flipdl^=1;
	prev_statl=new_statl;	
	if (flipdl) GPIOB->BRR = 0b0010000000000000;  
	else GPIOB->BSRR = 0b0010000000000000;
	if (bitl) GPIOB->BRR = 0b0100000000000000;   // this is top one!
	else GPIOB->BSRR = 0b0100000000000000;
 
	break;
	
    case 29: // was 56
      // Independent LFSR clocking regular SR (only in CV as speed) - TESTED/WORKING!
      // can use CV as length of either SR = here is regularSR
      //       - TESTED/working
      SRlengthl=(ADCBuffer[3]>>11);
      if (SRlengthl<4) SRlengthl=4;
      lengthbitl=(1<<(SRlengthl/2));
	
	if (shift_registerxl==0) shift_registerxl=0xff; // catch it!
	//	bitl= ((shift_registerl >> (lfsr_taps_mirrored[SRlengthl][0])) ^ (shift_registerl >> (lfsr_taps_mirrored[SRlengthl][1])) ^ (shift_registerl >> (lfsr_taps_mirrored[SRlengthl][2])) ^ (shift_registerl >> (lfsr_taps_mirrored[SRlengthl][3]))) & 1u; // 32 is 31, 29, 25, 24
	bitl= ((shift_registerxl >> 31) ^ (shift_registerxl >> 29) ^ (shift_registerxl >> 25) ^ (shift_registerxl >> 24)) & 1u; // 32 is 31, 29, 25, 24
	shift_registerxl = (shift_registerxl<<1) + bitl; // could or with incoming as we don't use this TESTY: shift_registerxl = (shift_registerx<<1) + (bitl | !(GPIOB->IDR & 0x0040)); 

	if (bitl){ // calculate and output new bitl with case 3 Turing Machine:
	  bitl = (shift_registerl>>SRlengthl) & 0x01; // bit which would be shifted out 
	  if (GPIOB->IDR & 0x0040) shift_registerl = (shift_registerl<<1) + bitl;
	  else shift_registerl = (shift_registerl<<1) + (!bitl);

	// for divide down
	new_statl=(shift_registerl & (1<<15))>>15; // so that is not just a simple divide down
	if (prev_statl==0 && new_statl==1) flipdl^=1;
	prev_statl=new_statl;	
	if (flipdl) GPIOB->BRR = 0b0010000000000000;  
	else GPIOB->BSRR = 0b0010000000000000;
	if (bitl) GPIOB->BRR = 0b0100000000000000;   // this is top one!
	else GPIOB->BSRR = 0b0100000000000000;
	}
	break;

    case 30: // was 57
      // Independent LFSR clocking regular SR (only in CV as speed) - TESTED/WORKING!
      // can use CV as length of either SR = here is SRx
      //       - TESTED/working but not so satisfying for ADCBuffer[3] use
      SRlengthx=(ADCBuffer[3]>>11);
      if (SRlengthx<4) SRlengthx=4;
	
