microresearch/allcolours/software/STM32F103/src/stm32f10x_it_DAC.c
	if (shift_registerxl==0) shift_registerxl=0xff; // catch it!
	bitl= ((shift_registerxl >> (lfsr_taps_mirrored[SRlengthx][0])) ^ (shift_registerxl >> (lfsr_taps_mirrored[SRlengthx][1])) ^ (shift_registerxl >> (lfsr_taps_mirrored[SRlengthx][2])) ^ (shift_registerxl >> (lfsr_taps_mirrored[SRlengthx][3]))) & 1u; // 32 is 31, 29, 25, 24
	//	bitl= ((shift_registerx >> 31) ^ (shift_registerx >> 29) ^ (shift_registerx >> 25) ^ (shift_registerx >> 24)) & 1u; // 32 is 31, 29, 25, 24
	shift_registerxl = (shift_registerxl<<1) + bitl; // could or with incoming as we don't use this TESTY: shift_registerx = (shift_registerx<<1) + (bitl | !(GPIOB->IDR & 0x0040)); 

	if (bitl){ // calculate and output new bitl with case 3 Turing Machine:
	  bitl = (shift_registerl>>31) & 0x01; // bit which would be shifted out 
	  if (GPIOB->IDR & 0x0040) shift_registerl = (shift_registerl<<1) + bitl;
	  else shift_registerl = (shift_registerl<<1) + (!bitl);

	// for divide down
	new_statl=(shift_registerl & (1<<15))>>15; // so that is not just a simple divide down
	if (prev_statl==0 && new_statl==1) flipdl^=1;
	prev_statl=new_statl;	
	if (flipdl) GPIOB->BRR = 0b0010000000000000;  
	else GPIOB->BSRR = 0b0010000000000000;
	if (bitl) GPIOB->BRR = 0b0100000000000000;   // this is top one!
	else GPIOB->BSRR = 0b0100000000000000;
	}
	break;

    case 31: // was 58 -  change the shifting amount 
      shifter=(ADCBuffer[3]>>11);
      if (shifter==0) shifter=1;
      // TM here
      bitl = (shift_registerl>>(31-(shifter-1))) & (shifter); // bits which would be shifted out  // 1 for length of 31
      if (GPIOB->IDR & 0x0040) shift_registerl = (shift_registerl<<shifter) + bitl;
      else shift_registerl = (shift_registerl<<shifter) + (~bitl);

	// for divide down
	new_statl=(shift_registerl & (1<<15))>>15; // so that is not just a simple divide down
	if (prev_statl==0 && new_statl==1) flipdl^=1;
	prev_statl=new_statl;	
	if (flipdl) GPIOB->BRR = 0b0010000000000000;  
	else GPIOB->BSRR = 0b0010000000000000;
	if (bitl) GPIOB->BRR = 0b0100000000000000;   // this is top one!
	else GPIOB->BSRR = 0b0100000000000000;
      break;

      /////
      //// LF DAC modes - equal weights
      ///.......
      
    case 48: // was 10
      //->>>>>>>>>>>>>> entry into SR from CV - TM = no input bit 
      lcount++;
      if (lcount>7) lcount=0;
      bitl = (shift_registerl>>31) & 0x01; // bit which would be shifted out
      
      if((ADCBuffer[3]>>(8+lcount))&1) shift_registerl = (shift_registerl<<1) + (!bitl); // or we could & with input bit - TO TEST!
      else shift_registerl = (shift_registerl<<1) + bitl;

	// for divide down
	new_statl=(shift_registerl & (1<<15))>>15; // so that is not just a simple divide down
	if (prev_statl==0 && new_statl==1) flipdl^=1;
	prev_statl=new_statl;	
	if (flipdl) GPIOB->BRR = 0b0010000000000000;  
	else GPIOB->BSRR = 0b0010000000000000;
	if (bitl) GPIOB->BRR = 0b0100000000000000;   // this is top one!
	else GPIOB->BSRR = 0b0100000000000000;

	// testing equal weightings
	tmp=bitsz[shift_registerl&0xff]+bitsz[(shift_registerl>>8)&0xff];
	tmp*=312; 
	spl=312+tmp; // 17*312=5304 - as we want on the lower side (not as in HF modes)
	TIM3->ARR =spl;
	TIM3->CCR1 = spl/2; // pulse width
	break;
      
    case 49: // was 12 - works fine with cv in - was 8 - extra DAC modes
      //->>>>>>>>>>>>>> NEW mode TESTY: entry of ADC in from CV into upper bits?
      bitl = (shift_registerl>>31) & 0x01; // bit which would be shifted out

      if (counter12l > 7){       // every 8 cycles
	counter12l=0;
	shift_registerl &= MASK[31]; // MASK is the INVERTED one eg. ~(Oxff) for bottom 8 bits - bottom/lower is where SR is for lower lengths
	shift_registerl +=(ADCBuffer[3]>>8)<<(SHIFT[31]);  // tested and this makes sense on test.c
      }
      counter12l++;

      shift_registerl=(shift_registerl<<1) + (bitl |  (!(GPIOB->IDR & 0x0040))); // cycle around and OR in pulse bit! TESTY!

	// for divide down
	new_statl=(shift_registerl & (1<<15))>>15; // so that is not just a simple divide down
	if (prev_statl==0 && new_statl==1) flipdl^=1;
	prev_statl=new_statl;	
	if (flipdl) GPIOB->BRR = 0b0010000000000000;  
	else GPIOB->BSRR = 0b0010000000000000;
	if (bitl) GPIOB->BRR = 0b0100000000000000;   // this is top one!
	else GPIOB->BSRR = 0b0100000000000000;	

	// testing equal weightings
	tmp=bitsz[shift_registerl&0xff]+bitsz[(shift_registerl>>8)&0xff];
	tmp*=312; 
	spl=312+tmp; // 17*312=5304 - as we want on the lower side (not as in HF modes)
	TIM3->ARR =spl;
	TIM3->CCR1 = spl/2; // pulse width
	break;
      
    case 50: // was 43
      // as above but other way round with CV for length and incoming bits for probability of TM
      SRlengthl=31-(ADCBuffer[3]>>11);
      if (SRlengthl<4) SRlengthl=4;
      lengthbitl=(1<<(SRlengthl/2));

      bitl = (shift_registerl>>SRlengthl) & 0x01; // bit which would be shifted out -

      if (lcount>7) lcount=0;
      if( !(GPIOB->IDR & 0x0040)) probl^=(1<<lcount);
      lcount++;
      
      if (((probl | shift_registerh) & 0xff ) == 0xff) shift_registerl = (shift_registerl<<1) + bitl;
      else shift_registerl = (shift_registerl<<1) + (!bitl);
      
	// for divide down
	new_statl=(shift_registerl & (1<<15))>>15; // so that is not just a simple divide down
	if (prev_statl==0 && new_statl==1) flipdl^=1;
	prev_statl=new_statl;	
	if (flipdl) GPIOB->BRR = 0b0010000000000000;  
	else GPIOB->BSRR = 0b0010000000000000;
	if (bitl) GPIOB->BRR = 0b0100000000000000;   // this is top one!
	else GPIOB->BSRR = 0b0100000000000000;

	// testing equal weightings
	tmp=bitsz[shift_registerl&0xff]+bitsz[(shift_registerl>>8)&0xff];
	tmp*=312; 
	spl=312+tmp; // 17*312=5304 - as we want on the lower side (not as in HF modes)
	TIM3->ARR =spl;
	TIM3->CCR1 = spl/2; // pulse width
	break;
	      
    case 51: // was 44
      // as mode 10 
      //->>>>>>>>>>>>>> entry into SR from CV - TM = no input bit = 1st option of above... - *more maybe on LF side these ones*
      // - TESTED/WORKING!
      if (!(GPIOB->IDR & 0x0040)){
	lcount++;
	if (lcount>7) lcount=0;
	bitl = (shift_registerl>>31) & 0x01; // bit which would be shifted out
	if((ADCBuffer[3]>>(8+lcount))&1) shift_registerl = (shift_registerl<<1) + (!bitl); // or we could & with input bit - TO TEST!
	else shift_registerl = (shift_registerl<<1) + bitl;

	// for divide down
	new_statl=(shift_registerl & (1<<15))>>15; // so that is not just a simple divide down
	if (prev_statl==0 && new_statl==1) flipdl^=1;
	prev_statl=new_statl;	
	if (flipdl) GPIOB->BRR = 0b0010000000000000;  
	else GPIOB->BSRR = 0b0010000000000000;
	if (bitl) GPIOB->BRR = 0b0100000000000000;   // this is top one!
	else GPIOB->BSRR = 0b0100000000000000;	

