microresearch/allcolours/software/STM32F103/src/stm32f10x_it_DAC.c
      }
      // PWM could be inside }

	// testing equal weightings
	tmp=bitsz[shift_registerl&0xff]+bitsz[(shift_registerl>>8)&0xff];
	tmp*=312; 
	spl=312+tmp; // 17*312=5304 - as we want on the lower side (not as in HF modes)
	TIM3->ARR =spl;
	TIM3->CCR1 = spl/2; // pulse width
	break;

    case 52: // was 45
      //->>>>>>>>>>>>>> entry into SR from CV - TM = no input bit = 3rd option of above...
      	// - TESTED/WORKING!
      lcount++;
      if (lcount>7) lcount=0;
	bitl = (shift_registerl>>31) & 0x01; // bit which would be shifted out
	if((ADCBuffer[3]>>(8+lcount))&1) shift_registerl = (shift_registerl<<1) + (!bitl); // or we could & with input bit - TO TEST!
	else shift_registerl = (shift_registerl<<1) + bitl;

	if (!(GPIOB->IDR & 0x0040)){
	// for divide down
	new_statl=(shift_registerl & (1<<15))>>15; // so that is not just a simple divide down
	if (prev_statl==0 && new_statl==1) flipdl^=1;
	prev_statl=new_statl;	
	if (flipdl) GPIOB->BRR = 0b0010000000000000;  
	else GPIOB->BSRR = 0b0010000000000000;
	if (bitl) GPIOB->BRR = 0b0100000000000000;   // this is top one!
	else GPIOB->BSRR = 0b0100000000000000;	
      }
      // PWM could be inside }

	// testing equal weightings
	tmp=bitsz[shift_registerl&0xff]+bitsz[(shift_registerl>>8)&0xff];
	tmp*=312; 
	spl=312+tmp; // 17*312=5304 - as we want on the lower side (not as in HF modes)
	TIM3->ARR =spl;
	TIM3->CCR1 = spl/2; // pulse width
	break;

    case 53: // was 47 maybe replace
      // *we could use CV to set length of pulse (say up to 128 which is 7 bits >> 9)*
      //->>>>>>>>>>>>>> as mode 14=speed divider with XOR rungler: XOR out with input bit
      	// - TESTED/WORKING! - not so exciting ....
      bitl = (shift_registerl>>31) & 0x01; // bit which would be shifted out
      shift_registerl = (shift_registerl<<1) + ((bitl) ^ (!(GPIOB->IDR & 0x0040)));

	// for divide down
	new_statl=(shift_registerl & (1<<15))>>15; // so that is not just a simple divide down
	if (prev_statl==0 && new_statl==1) flipdl^=1;
	prev_statl=new_statl;	
      
	if (bitl) {
	  GPIOB->BRR = 0b0010000000000000; 
	  delay(ADCBuffer[3]>>9); // 64=10uS - short = lower voltage...
	  GPIOB->BSRR = 0b0010000000000000;  
	}
	  
	if (flipdl) {
	  GPIOB->BRR = 0b0100000000000000;  
	  delay(ADCBuffer[3]>>9); // 64=10uS
	  GPIOB->BSRR = 0b0100000000000000;  
	  }

	// testing equal weightings
	tmp=bitsz[shift_registerl&0xff]+bitsz[(shift_registerl>>8)&0xff];
	tmp*=312; 
	spl=312+tmp; // 17*312=5304 - as we want on the lower side (not as in HF modes)
	TIM3->ARR =spl;
	TIM3->CCR1 = spl/2; // pulse width
	break;
	
    case 54: // was 51
      //->>>>>>>>>>>>>> Electronotes: CV selects which bits to set to 1 = chance of change
      // TESTED/WORKING!
      bitl = (shift_registerl>>31) & 0x01; // bit which would be shifted out -
      probl=ADCBuffer[3]>>13; // 3 bits now for electroprob array
      probl=electroprob[probl];

      if (((probl | shift_registerh) & 0xff ) == 0xff) shift_registerl = (shift_registerl<<1) + ((shift_registerh>>31) & 0x01); 
      else shift_registerl = (shift_registerl<<1) + bitl;

      if (!(GPIOB->IDR & 0x0040)){
	// for divide down
	new_statl=(shift_registerl & (1<<15))>>15; // so that is not just a simple divide down
	if (prev_statl==0 && new_statl==1) flipdl^=1;
	prev_statl=new_statl;	
	if (flipdl) GPIOB->BRR = 0b0010000000000000;  
	else GPIOB->BSRR = 0b0010000000000000;
	if (bitl) GPIOB->BRR = 0b0100000000000000;   // this is top one!
	else GPIOB->BSRR = 0b0100000000000000;	 
      }
      // PWM could be inside }

	// testing equal weightings
	tmp=bitsz[shift_registerl&0xff]+bitsz[(shift_registerl>>8)&0xff];
	tmp*=312; 
	spl=312+tmp; // 17*312=5304 - as we want on the lower side (not as in HF modes)
	TIM3->ARR =spl;
	TIM3->CCR1 = spl/2; // pulse width
      break;

    case 55: // was 53
      // - after case 25 - SR loops within SR at certain points?/sizes determined by CV or pulses in = basic SR of OR with incoming bits
      // change and Re_test this - TESTED/working
      // loop bitl back in XOR at certain point?
	bitl = (shift_registerl>>31) & 0x01; // bit which would be shifted out
	shift_registerl = (shift_registerl<<1);
	// do the loop back in
	lcount=ADCBuffer[3]>>11; // 5 bits - or: lcount=(ADCBuffer[3]>>11)%(SRlengthl+1);
	if (bitl) shift_registerl ^= (1<<lcount);// set the xth bit
	shift_registerl ^= (!(GPIOB->IDR & 0x0040));
	
	// for divide down
	new_statl=(shift_registerl & (1<<15))>>15; // so that is not just a simple divide down
	if (prev_statl==0 && new_statl==1) flipdl^=1;
	prev_statl=new_statl;	
	if (flipdl) GPIOB->BRR = 0b0010000000000000;  
	else GPIOB->BSRR = 0b0010000000000000;
	if (bitl) GPIOB->BRR = 0b0100000000000000;   // this is top one!
	else GPIOB->BSRR = 0b0100000000000000;

	// testing equal weightings
	tmp=bitsz[shift_registerl&0xff]+bitsz[(shift_registerl>>8)&0xff];
	tmp*=312; 
	spl=312+tmp; // 17*312=5304 - as we want on the lower side (not as in HF modes)
	TIM3->ARR =spl;
	TIM3->CCR1 = spl/2; // pulse width
	break;

    case 56: // - TEST CASE FOR new ADC/DAC modes...
      //this version works fine and we could also use 0x0040 to choose recycle or not
      //->>>>>>>>>>>>>> NEW mode TESTY: entry of ADC in from CV into upper bits?
      bitl = (shift_registerl>>31) & 0x01; // bit which would be shifted out

      // TESTY - put 4 bits in at 4 points and take out at 4 points 
      if (counter12l > 7){       // every 8 cycles
	counter12l=0;
	//	shift_registerl &= MASK[31]; // MASK is the INVERTED one eg. ~(Oxff) for bottom 8 bits - bottom/lower is where SR is for lower lengths
	//	shift_registerl +=(ADCBuffer[3]>>8)<<(SHIFT[31]);  // tested and this makes sense on test.c
	shift_registerl +=((ADCBuffer[3]>>8));  // tested and this makes sense on test.c
	//	shift_registerl +=1;
	//	shift_registerl &=(ADCBuffer[3]>>8);
      }
      counter12l++;
      
      //      shift_registerl=(shift_registerl<<1) + (bitl |  (!(GPIOB->IDR & 0x0040))); // cycle around and OR in pulse bit! TESTY! - or no recycle
      if (GPIOB->IDR & 0x0040) shift_registerl =  (shift_registerl<<1) + bitl;
      else shift_registerl=(shift_registerl<<1);

      // for divide down
	new_statl=(shift_registerl & (1<<15))>>15; // so that is not just a simple divide down
	if (prev_statl==0 && new_statl==1) flipdl^=1;
	prev_statl=new_statl;	
	if (flipdl) GPIOB->BRR = 0b0010000000000000;  
	else GPIOB->BSRR = 0b0010000000000000;
	if (bitl) GPIOB->BRR = 0b0100000000000000;   // this is top one!
	else GPIOB->BSRR = 0b0100000000000000;	

	// testing equal weightings
	tmp=bitsz[shift_registerl&0xff]+bitsz[(shift_registerl>>8)&0xff];
	tmp*=312; 
	spl=312+tmp; // 17*312=5304 - as we want on the lower side (not as in HF modes)
	TIM3->ARR =spl;
	TIM3->CCR1 = spl/2; // pulse width
	break;

    case 57: // - TEST CASE FOR new ADC/DAC modes...
      // shift in bits one by one use probl as storage

      bitl = (shift_registerl>>31) & 0x01; // bit which would be shifted out
      counter12l++;
      if (counter12l > 7){       // every 8 cycles
	counter12l=0;
	// store the full bit or take successive bits
	probl=(ADCBuffer[3]>>8); // probl is 8 bits
	}
      
      // shift that new bit in (or this could depend on 0x400 for recycles
      if (GPIOB->IDR & 0x0040) shift_registerl =  (shift_registerl<<1) + bitl;
      else shift_registerl=(shift_registerl<<1) + ((probl&bits[counter12l])>>counter12l);
      
	// for divide down
	new_statl=(shift_registerl & (1<<15))>>15; // so that is not just a simple divide down
	if (prev_statl==0 && new_statl==1) flipdl^=1;
	prev_statl=new_statl;	
	if (flipdl) GPIOB->BRR = 0b0010000000000000;  
	else GPIOB->BSRR = 0b0010000000000000;
	if (bitl) GPIOB->BRR = 0b0100000000000000;   // this is top one!
	else GPIOB->BSRR = 0b0100000000000000;	
 
	// testing equal weightings
	tmp=bitsz[shift_registerl&0xff]+bitsz[(shift_registerl>>8)&0xff];
	tmp*=312; 
	spl=312+tmp; // 17*312=5304 - as we want on the lower side (not as in HF modes)
	TIM3->ARR =spl;
	TIM3->CCR1 = spl/2; // pulse width
      break;
     
    case 58: // TEST CASE FOR new ADC/DAC modes...
      // put say 4 or 8 bits in at intervals - no recycle so far - works so far!
      // and DAC out is at later intervals
      bitl = (shift_registerl>>31) & 0x01; // bit which would be shifted out

      // try for 4 bits in - at intervals of 32/4= 8 bits: 1, 8, 16, 24
      shift_registerl &= 0b11111110111111101111111011111110; // inverted mask: 0b11111110111111101111111011111110 LSB is at end
      // put the 4 bits in
      probl=(ADCBuffer[3]>>12); // 4 bits
      shift_registerl += ( (probl&0x01) + ((probl&0x02)<<7) + ((probl&0x04)<<14) + ((probl&0x08)<<21)); // would be 0 8-1 16-2 24-3

      shift_registerl=(shift_registerl<<1);// + bitl;
	// for divide down
	new_statl=(shift_registerl & (1<<15))>>15; // so that is not just a simple divide down
	if (prev_statl==0 && new_statl==1) flipdl^=1;
	prev_statl=new_statl;	
	if (flipdl) GPIOB->BRR = 0b0010000000000000;  
	else GPIOB->BSRR = 0b0010000000000000;
	if (bitl) GPIOB->BRR = 0b0100000000000000;   // this is top one!
	else GPIOB->BSRR = 0b0100000000000000;	
 
      spl= (((shift_registerl&(1<<7))>>7) + ((shift_registerl&(1<<15))>>14) + ((shift_registerl&(1<<23))>>21) + ((shift_registerl&(1<<31))>>28))<<6; // this one from test.c tested... so that is 4 bits <<4 to 10 bits = 1024 11 is 2048 12 is 4096
// keeps it high!

      spl=1336-spl; // try 312+1024=1336- 312+2048=2360
      TIM3->ARR =spl;
      TIM3->CCR1 = spl/2; // pulse width	
      break;

