microresearch/allcolours/software/STM32F103/src/stm32f10x_it_DAC.c
    case 59: // TEST CASE FOR new ADC/DAC modes...
      // put say 4 or 8 bits in at intervals
      // ** cycle the SR
      // and DAC out is at later intervals
      bitl = (shift_registerl>>31) & 0x01; // bit which would be shifted out

      // try for 4 bits in - at intervals of 32/4= 8 bits: 1, 8, 16, 24
      shift_registerl &= 0b11111110111111101111111011111110; // inverted mask: 0b11111110111111101111111011111110 LSB is at end
      // put the 4 bits in
      probl=(ADCBuffer[3]>>12); // 4 bits
      shift_registerl += ( ((probl&0x01)^bitl) + ((probl&0x02)<<7) + ((probl&0x04)<<14) + ((probl&0x08)<<21)); // would be 0 8-1 16-2 24-3

      shift_registerl=(shift_registerl<<1);// + bitl; // can be with or without extra incoming bit

      // for divide down
	new_statl=(shift_registerl & (1<<15))>>15; // so that is not just a simple divide down
	if (prev_statl==0 && new_statl==1) flipdl^=1;
	prev_statl=new_statl;	
	if (flipdl) GPIOB->BRR = 0b0010000000000000;  
	else GPIOB->BSRR = 0b0010000000000000;
	if (bitl) GPIOB->BRR = 0b0100000000000000;   // this is top one!
	else GPIOB->BSRR = 0b0100000000000000;	
 	
      spl= (((shift_registerl&(1<<7))>>7) + ((shift_registerl&(1<<15))>>14) + ((shift_registerl&(1<<23))>>21) + ((shift_registerl&(1<<31))>>28))<<7; // this one from test.c tested...

      spl=2360-spl; // try 312+1024=1336- 312+2048=2360
      TIM3->ARR =spl;
      TIM3->CCR1 = spl/2; // pulse width
      break;

    case 60: // TEST CASE FOR new ADC/DAC modes...
      // put say 4 or 8 bits in at intervals
      // ** SR with incoming bit
      // and DAC out is at later intervals
      bitl = (shift_registerl>>31) & 0x01; // bit which would be shifted out

      // try for 4 bits in - at intervals of 32/4= 8 bits: 1, 8, 16, 24
      shift_registerl &= 0b11111110111111101111111011111110; // inverted mask: 0b11111110111111101111111011111110 LSB is at end
      // put the 4 bits in
      probl=(ADCBuffer[3]>>12); // 4 bits
      shift_registerl += ( ((probl&0x01)^(!(GPIOB->IDR & 0x0040))) + ((probl&0x02)<<7) + ((probl&0x04)<<14) + ((probl&0x08)<<21)); // would be 0 8-1 16-2 24-3

      shift_registerl=(shift_registerl<<1);// + bitl; // can be with or without extra incoming bit

      // for divide down
	new_statl=(shift_registerl & (1<<15))>>15; // so that is not just a simple divide down
	if (prev_statl==0 && new_statl==1) flipdl^=1;
	prev_statl=new_statl;	
	if (flipdl) GPIOB->BRR = 0b0010000000000000;  
	else GPIOB->BSRR = 0b0010000000000000;
	if (bitl) GPIOB->BRR = 0b0100000000000000;   // this is top one!
	else GPIOB->BSRR = 0b0100000000000000;	
 
      // no extract those 4 bits from the last slots bits 32, 24, 16 and 8, shift these and then << say 4 bits
      //	  spl= (((shift_registerl&(1<<8))>>8) + ((shift_registerl&(1<<16))>>15) + ((shift_registerl&(1<<24))>>22) + ((shift_registerl&(1<<32))>>29))<<4;

      spl= (((shift_registerl&(1<<7))>>7) + ((shift_registerl&(1<<15))>>14) + ((shift_registerl&(1<<23))>>21) + ((shift_registerl&(1<<31))>>28))<<7; // this one from test.c tested...
      spl=2360-spl;
      TIM3->ARR =spl;
      TIM3->CCR1 = spl/2; // pulse width
      break;

    case 61: // TEST CASE FOR new ADC/DAC modes...      
      // let's try for 8 bits
      // check logic of this one after 3 bit shifts in test.c -> tested with one mistake fixed
      bitl = (shift_registerl>>31) & 0x01; // bit which would be shifted out

      // try for 8 bits in at 3 bits intervals
      shift_registerl &= 0b11101110111011101110111011101110; // inverted mask: 0b11111110111111101111111011111110 LSB is at end
      // put the 8 bits in
      probl=(ADCBuffer[3]>>8); // 8 bits
      shift_registerl += (  ((probl&0x01)) + ((probl&0x02)<<3) + ((probl&0x04)<<6) + ((probl&0x08)<<9) + ((probl&0x10)<<12) + ((probl&0x20)<<15) + ((probl&0x40)<<18) + ((probl&0x80)<<21) );

      shift_registerl=(shift_registerl<<1);// + bitl; // can be with or without extra incoming bit
	// for divide down
	new_statl=(shift_registerl & (1<<15))>>15; // so that is not just a simple divide down
	if (prev_statl==0 && new_statl==1) flipdl^=1;
	prev_statl=new_statl;	
	if (flipdl) GPIOB->BRR = 0b0010000000000000;  
	else GPIOB->BSRR = 0b0010000000000000;
	if (bitl) GPIOB->BRR = 0b0100000000000000;   // this is top one!
	else GPIOB->BSRR = 0b0100000000000000;	
 
      spl= (((shift_registerl&(1<<3))>>3) + ((shift_registerl&(1<<7))>>6) + ((shift_registerl&(1<<11))>>9) + ((shift_registerl&(1<<15))>>12) + ((shift_registerl&(1<<19))>>15) +((shift_registerl&(1<<23))>>18) +((shift_registerl&(1<<27))>>21) +((shift_registerl&(1<<31))>>24))<<4; // this one from test.c tested...
      spl=4408-spl; // 12 bits=4096+312=4408
      TIM3->ARR =spl;
      TIM3->CCR1 = spl/2; // pulse width
      break;

    case 62: // TEST CASE FOR new ADC/DAC modes...
      // try and use incoming bit to shift 4 bits in lstack - working now
	lcount++;
      // but can go over - max we want now is 27
	if (lcount>27) lcount=0;
	if( !(GPIOB->IDR & 0x0040)) {
	  lstack[3]=lstack[2];
	  lstack[2]=lstack[1];
	  lstack[1]=lstack[0];
	  lstack[0]=lcount+1; // bump it on to the lstack
	}	  
      
      bitl = (shift_registerl>>31) & 0x01; // bit which would be shifted out

      // try for 4 bits in - at intervals of 32/4= 8 bits: 1, 8, 16, 24
      // we need a new mask
      //      shift_registerl &= 0b11111110111111101111111011111110; // inverted mask: 0b11111110111111101111111011111110 LSB is at end
      shift_registerl &= ~ (((0x01)<< lstack[0]) + ((0x02)<<lstack[1]) + ((0x04)<<lstack[2]) + ((0x08)<<lstack[3]));
      // put the 4 bits in
      probl=(ADCBuffer[3]>>12); // 4 bits
      shift_registerl += ( ((probl&0x01)<< lstack[0]) + ((probl&0x02)<<lstack[1]) + ((probl&0x04)<<lstack[2]) + ((probl&0x08)<<lstack[3])); // would be 0 8-1 16-2 24-3

      shift_registerl=(shift_registerl<<1) + bitl; // leave this as bitl
	// for divide down
	new_statl=(shift_registerl & (1<<15))>>15; // so that is not just a simple divide down
	if (prev_statl==0 && new_statl==1) flipdl^=1;
	prev_statl=new_statl;	
	if (flipdl) GPIOB->BRR = 0b0010000000000000;  
	else GPIOB->BSRR = 0b0010000000000000;
	if (bitl) GPIOB->BRR = 0b0100000000000000;   // this is top one!
	else GPIOB->BSRR = 0b0100000000000000;	
 
      spl= (((shift_registerl&(1<<7))>>7) + ((shift_registerl&(1<<15))>>14) + ((shift_registerl&(1<<23))>>21) + ((shift_registerl&(1<<31))>>28))<<7; // this one from test.c tested...
      spl=2360-spl;
      TIM3->ARR =spl;
      TIM3->CCR1 = spl/2; // pulse width
      break;

    case 63: // TEST CASE FOR new ADC/DAC modes...
	    // try and use incoming bit to shift 4 bits in lstack - working now
	    // same as above but now we do for the output bits - maybe not so interesting as just effects the DAC! seems oks!
	lcount++;

	if (lcount>16) lcount=0; // tweak this value!
	if( !(GPIOB->IDR & 0x0040)) {
	  lstack[3]=lstack[2];
	  lstack[2]=lstack[1];
	  lstack[1]=lstack[0];
	  lstack[0]=lcount+1; // bump it on to the lstack
	}	  
      
      bitl = (shift_registerl>>31) & 0x01; // bit which would be shifted out

      // try for 4 bits in - at intervals of 32/4= 8 bits: 1, 8, 16, 24
      shift_registerl &= 0b11111110111111101111111011111110; // inverted mask: 0b11111110111111101111111011111110 LSB is at end
      // put the 4 bits in
      probl=(ADCBuffer[3]>>12); // 4 bits
      //      shift_registerl += ( ((probl&0x01)<< lstack[0]) + ((probl&0x02)<<lstack[1]) + ((probl&0x04)<<lstack[2]) + ((probl&0x08)<<lstack[3])); // would be 0 8-1 16-2 24-3
      shift_registerl += ( ((probl&0x01)^bitl) + ((probl&0x02)<<7) + ((probl&0x04)<<14) + ((probl&0x08)<<21)); // would be 0 8-1 16-2 24-3
      shift_registerl=(shift_registerl<<1) + bitl;

      // for divide down
	new_statl=(shift_registerl & (1<<15))>>15; // so that is not just a simple divide down
	if (prev_statl==0 && new_statl==1) flipdl^=1;
	prev_statl=new_statl;	
	if (flipdl) GPIOB->BRR = 0b0010000000000000;  
	else GPIOB->BSRR = 0b0010000000000000;
	if (bitl) GPIOB->BRR = 0b0100000000000000;   // this is top one!
	else GPIOB->BSRR = 0b0100000000000000;	
 	
      spl= ( (shift_registerl&(1<<lstack[0])) + (shift_registerl&(1<<lstack[1])) + (shift_registerl&(1<<lstack[2])) + (shift_registerl&(1<<lstack[3])) ); // this one from test.c tested... - or we space out a bit
      spl+=312;
      TIM3->ARR =spl;
      TIM3->CCR1 = spl/2; // pulse width
      break;
    }       /// end of LF modes
  }

  // --------------------HF Pulse modes 
  if(pending & (1 << 7)) { // HF on 7/out on C
    EXTI->PR = 1 << 7;        // handle pin 7 here

//*PULSE_HF: 10, 11, 12, 13, 14, 15, 43, 44, 45, 48, 50, 52, 53, 56, 57, 58*
    
    switch(modehsr){
    case 16: // was 11 - leave in middle// MAYBE put this in middle of CV select mode for easy access TODO
      //->>>>>>>>>>>>>> CV selects length of SR -> LFSR here
      SRlengthh=31-(ADCBuffer[2]>>11);
      if (SRlengthh<4) SRlengthh=4;
      lengthbith=(SRlengthh/2);
      if (shift_registerh==0) shift_registerh=0xff;
      bith= ((shift_registerh >> (lfsr_taps[SRlengthh][0])) ^ (shift_registerh >> (lfsr_taps[SRlengthh][1])) ^ (shift_registerh >> (lfsr_taps[SRlengthh][2])) ^ (shift_registerh >> (lfsr_taps[SRlengthh][3]))) & 1u; // 32 is 31, 29, 25, 24
      shift_registerh = (shift_registerh<<1) + ((bith | !(GPIOB->IDR & 0x0400))); // PB7 and PB10

	// divide down
	new_stath=(shift_registerh & (1<<lengthbith))>>lengthbith; // so that is not just a simple divide down
	if (prev_stath==0 && new_stath==1) flipdh^=1;
	prev_stath=new_stath;	
	if (flipdh) GPIOC->BRR = 0b0010000000000000;  
	else GPIOC->BSRR = 0b0010000000000000;

	if (bith) GPIOC->BRR = 0b0100000000000000;   // this is top one!
	else GPIOC->BSRR = 0b0100000000000000;	
      break;
      
