microresearch/allcolours/software/STM32F103/src/stm32f10x_it_DAC.c
    case 17: // was 10
      //->>>>>>>>>>>>>> entry into SR from CV - TM = no input bit 
      hcount++;
      if (hcount>7) hcount=0;
      bith = (shift_registerh>>31) & 0x01; // bit which would be shifted out
      
      if((ADCBuffer[2]>>(8+hcount))&1) shift_registerh = (shift_registerh<<1) + (!bith); // or we could & with input bit - TO TEST!
      else shift_registerh = (shift_registerh<<1) + bith;

	// divide down
	new_stath=(shift_registerh & (1<<15))>>15; // so that is not just a simple divide down
	if (prev_stath==0 && new_stath==1) flipdh^=1;
	prev_stath=new_stath;	
	if (flipdh) GPIOC->BRR = 0b0010000000000000;  
	else GPIOC->BSRR = 0b0010000000000000;

	if (bith) GPIOC->BRR = 0b0100000000000000;   // this is top one!
	else GPIOC->BSRR = 0b0100000000000000;	
      break;
      
    case 18: // was 12 - works fine with cv in  TEST CASE FOR new ADC/DAC modes...
      bith = (shift_registerh>>31) & 0x01; // bit which would be shifted out

      if (counter12h > 7){       // every 8 cycles
	counter12h=0;
	shift_registerh &= MASK[31]; // MASK is the INVERTED one eg. ~(Oxff) for bottom 8 bits - bottom/lower is where SR is for lower lengths
	shift_registerh +=(ADCBuffer[2]>>8)<<(SHIFT[31]);  // tested and this makes sense on test.c
      }
      counter12h++;
      
      shift_registerh=(shift_registerh<<1) + (bith |  (!(GPIOB->IDR & 0x0400))); // cycle around and OR in pulse bit! TESTY! - or no recycle
      shift_registerh=(shift_registerh<<1) + (bith);

	// divide down
	new_stath=(shift_registerh & (1<<15))>>15; // so that is not just a simple divide down
	if (prev_stath==0 && new_stath==1) flipdh^=1;
	prev_stath=new_stath;	
	if (flipdh) GPIOC->BRR = 0b0010000000000000;  
	else GPIOC->BSRR = 0b0010000000000000;

	if (bith) GPIOC->BRR = 0b0100000000000000;   // this is top one!
	else GPIOC->BSRR = 0b0100000000000000;	
	break;
     
    case 19: // was 13
      //->>>>>>>>>>>>>> Electronotes: CV selects which bits to set to 1 = chance of change
      // we do not use bit IN!
      bith = (shift_registerh>>31) & 0x01; // bit which would be shifted out -
      probh=ADCBuffer[2]>>13; // 3 bits now for electroprob array
      probh=electroprob[probh];

      if (((probh | shift_registerl) & 0xff ) == 0xff) shift_registerh = (shift_registerh<<1) + ((shift_registerl>>31) & 0x01); // new bits enter from shiftregleft - 0xff was looker[7]
      else shift_registerh = (shift_registerh<<1) + bith;

	// divide down
	new_stath=(shift_registerh & (1<<15))>>15; // so that is not just a simple divide down
	if (prev_stath==0 && new_stath==1) flipdh^=1;
	prev_stath=new_stath;	
	if (flipdh) GPIOC->BRR = 0b0010000000000000;  
	else GPIOC->BSRR = 0b0010000000000000;

	if (bith) GPIOC->BRR = 0b0100000000000000;   // this is top one!
	else GPIOC->BSRR = 0b0100000000000000;	
      break;
            
    case 20: // was 14 - could replace mode or one of these ???
      //->>>>>>>>>>>>>> uses CV as speed/flipflop/clock divider
      // pulse in inverts the cycling bit in a la Turing Machine - cycle bit or invert bit = thus we do use input bit
      bith = (shift_registerh>>31) & 0x01; // bit which would be shifted out
      //      origbith=bith;
      if (GPIOB->IDR & 0x0400) shift_registerh =  (shift_registerh<<1) + bith;
      else shift_registerh = (shift_registerh<<1) + (!bith);

      // flip flop: rising edge - if last was 0 and now is 1 then we trigger flip 1-0 or 0-1
      numflips=(ADCBuffer[2]>>12); //or 15-(ADCBuffer[2]>>12) if we wish it to go in the opposite direction
      new_state[0]=bith;
      if (prev_state[0]==0 && new_state[0]==1) flipped[0]^=1;
      prev_state[0]=new_state[0];	

      for (x=1;x<numflips;x++){ 
	new_state[x]=flipped[x-1];
	if (prev_state[x]==0 && new_state[x]==1) flipped[x]^=1;
	prev_state[x]=new_state[x];
      }
      if (numflips>0)	bith=flipped[numflips-1];

	// divide down
	new_stath=bith; // its is just divided down
	if (prev_stath==0 && new_stath==1) flipdh^=1;
	prev_stath=new_stath;	
	if (flipdh) GPIOC->BRR = 0b0010000000000000;  
	else GPIOC->BSRR = 0b0010000000000000;

	if (bith) GPIOC->BRR = 0b0100000000000000;   // this is top one!
	else GPIOC->BSRR = 0b0100000000000000;	
	break;
            
      
    case 21: // was 15
      //->>>>>>>>>>>>>> as mode 14=speed divider with XOR rungler: XOR out with input bit
      bith = (shift_registerh>>31) & 0x01; // bit which would be shifted out
      shift_registerh = (shift_registerh<<1) + ((bith) ^ (!(GPIOB->IDR & 0x0400)));

      numflips=(ADCBuffer[2]>>12); //or 15-(ADCBuffer[2]>>12) if we wish it to go in the opposite direction
      new_state[0]=bith;
      if (prev_state[0]==0 && new_state[0]==1) flipped[0]^=1;
      prev_state[0]=new_state[0];	

      for (x=1;x<numflips;x++){ 
	new_state[x]=flipped[x-1];
	if (prev_state[x]==0 && new_state[x]==1) flipped[x]^=1;
	prev_state[x]=new_state[x];
      }
      if (numflips>0)	bith=flipped[numflips-1];

      // divide down - note this one is different
      new_stath = bith; // it is just divided down
      if (prev_stath==0 && new_stath==1) flipdh^=1;
      prev_stath=new_stath;	
      if (flipdh) GPIOC->BRR = 0b0010000000000000; 
      else GPIOC->BSRR = 0b0010000000000000;

      if (bith) GPIOC->BRR = 0b0100000000000000; // this is top one!     
      else GPIOC->BSRR = 0b0100000000000000;	
      break;

    case 22: // was 43
      // as above but other way round with CV for length and incoming bits for probability of TM
      SRlengthh=31-(ADCBuffer[2]>>11);
      if (SRlengthh<4) SRlengthh=4;
      lengthbith=(SRlengthh/2);
      
      bith = (shift_registerh>>SRlengthh) & 0x01; // bit which would be shifted out -

      if (hcount>7) hcount=0;
      if( !(GPIOB->IDR & 0x0400)) probh^=(1<<hcount);
      hcount++;
      
      if (((probh | shift_registerl) & 0xff ) == 0xff) shift_registerh = (shift_registerh<<1) + bith;
      else shift_registerh = (shift_registerh<<1) + (!bith);
      
	// divide down
	new_stath=(shift_registerh & (1<<lengthbith))>>lengthbith; // so that is not just a simple divide down
	if (prev_stath==0 && new_stath==1) flipdh^=1;
	prev_stath=new_stath;	
	if (flipdh) GPIOC->BRR = 0b0010000000000000;  
	else GPIOC->BSRR = 0b0010000000000000;

	if (bith) GPIOC->BRR = 0b0100000000000000;   // this is top one!
	else GPIOC->BSRR = 0b0100000000000000;	
      break;
      
    case 23: // was 44
      // as mode 10 
      //->>>>>>>>>>>>>> entry into SR from CV - TM = no input bit = 1st option of above... - *more maybe on LF side these ones*
      // - TESTED/WORKING!
      if (!(GPIOB->IDR & 0x0400)){
	hcount++;
	if (hcount>7) hcount=0;
	bith = (shift_registerh>>31) & 0x01; // bit which would be shifted out
	if((ADCBuffer[2]>>(8+hcount))&1) shift_registerh = (shift_registerh<<1) + (!bith); // or we could & with input bit - TO TEST!
	else shift_registerh = (shift_registerh<<1) + bith;

	// divide down
	new_stath=(shift_registerh & (1<<15))>>15; // so that is not just a simple divide down
	if (prev_stath==0 && new_stath==1) flipdh^=1;
	prev_stath=new_stath;	
	if (flipdh) GPIOC->BRR = 0b0010000000000000;  
	else GPIOC->BSRR = 0b0010000000000000;

	if (bith) GPIOC->BRR = 0b0100000000000000;   // this is top one!
	else GPIOC->BSRR = 0b0100000000000000;	
      }
      break;

