microresearch/allcolours/software/STM32F103/src/stm32f10x_it_DAC.c
    case 52: // was 45
      //->>>>>>>>>>>>>> entry into SR from CV - TM = no input bit = 3rd option of above...
      	// - TESTED/WORKING!
      hcount++;
      if (hcount>7) hcount=0;
	bith = (shift_registerh>>31) & 0x01; // bit which would be shifted out
	if((ADCBuffer[2]>>(8+hcount))&1) shift_registerh = (shift_registerh<<1) + (!bith); // or we could & with input bit - TO TEST!
	else shift_registerh = (shift_registerh<<1) + bith;

	if (!(GPIOB->IDR & 0x0400)){
	// divide down
	new_stath=(shift_registerh & (1<<15))>>15; // so that is not just a simple divide down
	if (prev_stath==0 && new_stath==1) flipdh^=1;
	prev_stath=new_stath;	
	if (flipdh) GPIOC->BRR = 0b0010000000000000;  
	else GPIOC->BSRR = 0b0010000000000000;

	if (bith) GPIOC->BRR = 0b0100000000000000;   // this is top one!
	else GPIOC->BSRR = 0b0100000000000000;	

      }
      // PWM could be inside }
	// To test equal weightings: so each bit is the same value - count number of bits - say for 16 bits
	tmp=bitsz[shift_registerh&0xff]+bitsz[(shift_registerh>>8)&0xff];//+bitsz[(shift_registerh>>16)&0xff]+bitsz[(shift_registerh>>24)&0xff]; // now 32 bits
	tmp*=312; // for 16 bits - how shall we calculate this range
	sph=312+tmp; // higher is lower
	TIM1->ARR =sph;
	TIM1->CCR1 = sph/2; // pulse width
      break;

    case 53: // was 48
      // NOTE: relies on shiftregisterl
      //      	  extra mode in which pulse on is triggered by bitH but gated off by input bit or pulse
      // use mode 13 as example here:::
      //->>>>>>>>>>>>>> Electronotes: CV selects which bits to set to 1 = chance of change
      	// - TESTED/WORKING!
      bith = (shift_registerh>>31) & 0x01; // bit which would be shifted out -
      probh=ADCBuffer[2]>>13; // 3 bits now for electroprob array
      probh=electroprob[probh];

      if (((probh | shift_registerl) & 0xff ) == 0xff) shift_registerh = (shift_registerh<<1) + ((shift_registerl>>31) & 0x01); // new bits enter from shiftregleft - 0xff was looker[7]
      else shift_registerh = (shift_registerh<<1) + bith;

	// divide down
	new_stath=(shift_registerh & (1<<15))>>15; // so that is not just a simple divide down
	if (prev_stath==0 && new_stath==1) flipdh^=1;
	prev_stath=new_stath;	
	if (flipdh) GPIOC->BRR = 0b0010000000000000;  
	else GPIOC->BSRR = 0b0010000000000000;

	if (bith) GPIOC->BRR = 0b0100000000000000;   // this is top one!
	else GPIOC->BSRR = 0b0100000000000000;	
      
	// To test equal weightings: so each bit is the same value - count number of bits - say for 16 bits
	tmp=bitsz[shift_registerh&0xff]+bitsz[(shift_registerh>>8)&0xff];//+bitsz[(shift_registerh>>16)&0xff]+bitsz[(shift_registerh>>24)&0xff]; // now 32 bits
	tmp*=312; // for 16 bits - how shall we calculate this range
	sph=312+tmp; // higher is lower
	TIM1->ARR =sph;
	TIM1->CCR1 = sph/2; // pulse width
	break;

    case 54: // was 50
      //->>>>>>>>>>>>>> Electronotes: CV selects which bits to set to 1 = chance of change
      // TESTED/WORKING!
      // NOTE: relies on shiftregisterl
      if (!(GPIOB->IDR & 0x0400)){
      bith = (shift_registerh>>31) & 0x01; // bit which would be shifted out -
      probh=ADCBuffer[2]>>13; // 3 bits now for electroprob array
      probh=electroprob[probh];

      if (((probh | shift_registerl) & 0xff ) == 0xff) shift_registerh = (shift_registerh<<1) + ((shift_registerl>>31) & 0x01); // new bits enter from shiftregleft - 0xff was looker[7]
      else shift_registerh = (shift_registerh<<1) + bith;

	// divide down
	new_stath=(shift_registerh & (1<<15))>>15; // so that is not just a simple divide down
	if (prev_stath==0 && new_stath==1) flipdh^=1;
	prev_stath=new_stath;	
	if (flipdh) GPIOC->BRR = 0b0010000000000000;  
	else GPIOC->BSRR = 0b0010000000000000;

	if (bith) GPIOC->BRR = 0b0100000000000000;   // this is top one!
	else GPIOC->BSRR = 0b0100000000000000;	
      }
      
	// To test equal weightings: so each bit is the same value - count number of bits - say for 16 bits
	tmp=bitsz[shift_registerh&0xff]+bitsz[(shift_registerh>>8)&0xff];//+bitsz[(shift_registerh>>16)&0xff]+bitsz[(shift_registerh>>24)&0xff]; // now 32 bits
	tmp*=312; // for 16 bits - how shall we calculate this range
	sph=312+tmp; // higher is lower
	TIM1->ARR =sph;
	TIM1->CCR1 = sph/2; // pulse width
      break;
      
    case 55: // was 53
      // - after case 25 - SR loops within SR at certain points?/sizes determined by CV or pulses in = basic SR of OR with incoming bits
      // change and Re_test this - TESTED/working
      // loop bith back in XOR at certain point?
      bith = (shift_registerh>>31) & 0x01; // bit which would be shifted out
      shift_registerh = (shift_registerh<<1);
      // do the loop back in
      hcount=ADCBuffer[2]>>11; // 5 bits - or: hcount=(ADCBuffer[2]>>11)%(31+1);
      if (bith) shift_registerh ^= (1<<hcount);// set the xth bit
      shift_registerh ^= (!(GPIOB->IDR & 0x0400));
	
	// divide down
	new_stath=(shift_registerh & (1<<15))>>15; // so that is not just a simple divide down
	if (prev_stath==0 && new_stath==1) flipdh^=1;
	prev_stath=new_stath;	
	if (flipdh) GPIOC->BRR = 0b0010000000000000;  
	else GPIOC->BSRR = 0b0010000000000000;

	if (bith) GPIOC->BRR = 0b0100000000000000;   // this is top one!
	else GPIOC->BSRR = 0b0100000000000000;	
      
	// To test equal weightings: so each bit is the same value - count number of bits - say for 16 bits
	tmp=bitsz[shift_registerh&0xff]+bitsz[(shift_registerh>>8)&0xff];//+bitsz[(shift_registerh>>16)&0xff]+bitsz[(shift_registerh>>24)&0xff]; // now 32 bits
	tmp*=312; // for 16 bits - how shall we calculate this range
	sph=312+tmp; // higher is lower
	TIM1->ARR =sph;
	TIM1->CCR1 = sph/2; // pulse width
	break;

    case 56: // - TEST CASE FOR new ADC/DAC modes...
	  //this version works fine and we could also use 0x0400 to choose recycle or not
      //->>>>>>>>>>>>>> NEW mode TESTY: entry of ADC in from CV into upper bits?
      bith = (shift_registerh>>31) & 0x01; // bit which would be shifted out

