microresearch/allcolours/software/STM32F103/src/stm32f10x_it_DAC.c
      // TESTY - put 4 bits in at 4 points and take out at 4 points 
      if (counter12h > 7){       // every 8 cycles
	counter12h=0;
	//	shift_registerh &= MASK[31]; // MASK is the INVERTED one eg. ~(Oxff) for bottom 8 bits - bottom/lower is where SR is for lower lengths
	//	shift_registerh +=(ADCBuffer[2]>>8)<<(SHIFT[31]);  // tested and this makes sense on test.c
	shift_registerh +=(ADCBuffer[2]>>8);  // tested and this makes sense on test.c
	//	shift_registerh &=(ADCBuffer[2]>>8);
      }
      counter12h++;
      //      shift_registerh=(shift_registerh<<1) + (bith |  (!(GPIOB->IDR & 0x0400))); // cycle around and OR in pulse bit! TESTY! - or no recycle
      if (GPIOB->IDR & 0x0400) shift_registerh =  (shift_registerh<<1) + bith;
      else shift_registerh=(shift_registerh<<1);

      // divide down
	new_stath=(shift_registerh & (1<<15))>>15; // so that is not just a simple divide down
	if (prev_stath==0 && new_stath==1) flipdh^=1;
	prev_stath=new_stath;	
	if (flipdh) GPIOC->BRR = 0b0010000000000000;  
	else GPIOC->BSRR = 0b0010000000000000;

	if (bith) GPIOC->BRR = 0b0100000000000000;   // this is top one!
	else GPIOC->BSRR = 0b0100000000000000;	
	
	// To test equal weightings: so each bit is the same value - count number of bits - say for 16 bits
	tmp=bitsz[shift_registerh&0xff]+bitsz[(shift_registerh>>8)&0xff];//+bitsz[(shift_registerh>>16)&0xff]+bitsz[(shift_registerh>>24)&0xff]; // now 32 bits
	tmp*=312; // for 16 bits - how shall we calculate this range
	sph=312+tmp; // higher is lower
	TIM1->ARR =sph;
	TIM1->CCR1 = sph/2; // pulse width
	break;

    case 57: // - TEST CASE FOR new ADC/DAC modes...
      // shift in bits one by one use probh as storage

      bith = (shift_registerh>>31) & 0x01; // bit which would be shifted out
      counter12h++;
      if (counter12h > 7){       // every 8 cycles
	counter12h=0;
	// store the full bit or take successive bits
	probh=(ADCBuffer[2]>>8); // probh is 8 bits
	}
      
      //      shift_registerh=(shift_registerh<<1) + (bith |  (!(GPIOB->IDR & 0x0400))); // cycle around and OR in pulse bit! TESTY! - or no recycle
      //      if (GPIOB->IDR & 0x0400) shift_registerh =  (shift_registerh<<1) + bith;
      //      else shift_registerh=(shift_registerh<<1);

      // shift that new bit in (or this could depend on 0x400 for recycles
      if (GPIOB->IDR & 0x0400) shift_registerh =  (shift_registerh<<1) + bith;
      else shift_registerh=(shift_registerh<<1) + ((probh&bits[counter12h])>>counter12h);

      // divide down
	new_stath=(shift_registerh & (1<<15))>>15; // so that is not just a simple divide down
	if (prev_stath==0 && new_stath==1) flipdh^=1;
	prev_stath=new_stath;	
	if (flipdh) GPIOC->BRR = 0b0010000000000000;  
	else GPIOC->BSRR = 0b0010000000000000;

	if (bith) GPIOC->BRR = 0b0100000000000000;   // this is top one!
	else GPIOC->BSRR = 0b0100000000000000;	
	
	// To test equal weightings: so each bit is the same value - count number of bits - say for 16 bits
	tmp=bitsz[shift_registerh&0xff]+bitsz[(shift_registerh>>8)&0xff];//+bitsz[(shift_registerh>>16)&0xff]+bitsz[(shift_registerh>>24)&0xff]; // now 32 bits
	tmp*=312; // for 16 bits - how shall we calculate this range
	sph=312+tmp; // higher is lower
	TIM1->ARR =sph;
	TIM1->CCR1 = sph/2; // pulse width
	break;
     
    case 58: // TEST CASE FOR new ADC/DAC modes...
      // put say 4 or 8 bits in at intervals - no recycle so far - works so far!
      // and DAC out is at later intervals
      bith = (shift_registerh>>31) & 0x01; // bit which would be shifted out

      // try for 4 bits in - at intervals of 32/4= 8 bits: 1, 8, 16, 24
      shift_registerh &= 0b11111110111111101111111011111110; // inverted mask: 0b11111110111111101111111011111110 LSB is at end
      // put the 4 bits in
      probh=(ADCBuffer[2]>>12); // 4 bits
      shift_registerh += ( (probh&0x01) + ((probh&0x02)<<7) + ((probh&0x04)<<14) + ((probh&0x08)<<21)); // would be 0 8-1 16-2 24-3


      shift_registerh=(shift_registerh<<1);// + bith;
	// divide down
	new_stath=(shift_registerh & (1<<15))>>15; // so that is not just a simple divide down
	if (prev_stath==0 && new_stath==1) flipdh^=1;
	prev_stath=new_stath;	
	if (flipdh) GPIOC->BRR = 0b0010000000000000;  
	else GPIOC->BSRR = 0b0010000000000000;

	if (bith) GPIOC->BRR = 0b0100000000000000;   // this is top one!
	else GPIOC->BSRR = 0b0100000000000000;	
	
      sph= (((shift_registerh&(1<<7))>>7) + ((shift_registerh&(1<<15))>>14) + ((shift_registerh&(1<<23))>>21) + ((shift_registerh&(1<<31))>>28))<<6; // this one from test.c tested... so that is 4 bits <<4 to 10 bits = 1024 11 is 2048 12 is 4096

      // keeps it high!
      sph=1336-sph; // try 312+1024=1336- 312+2048=2360
      TIM1->ARR =sph;
      TIM1->CCR1 = sph/2; // pulse width	
      break;

    case 59: // TEST CASE FOR new ADC/DAC modes...
      // put say 4 or 8 bits in at intervals
      // ** cycle the SR
      // and DAC out is at later intervals
      bith = (shift_registerh>>31) & 0x01; // bit which would be shifted out

      // try for 4 bits in - at intervals of 32/4= 8 bits: 1, 8, 16, 24
      shift_registerh &= 0b11111110111111101111111011111110; // inverted mask: 0b11111110111111101111111011111110 LSB is at end
      // put the 4 bits in
      probh=(ADCBuffer[2]>>12); // 4 bits
      shift_registerh += ( ((probh&0x01)^bith) + ((probh&0x02)<<7) + ((probh&0x04)<<14) + ((probh&0x08)<<21)); // would be 0 8-1 16-2 24-3
      shift_registerh=(shift_registerh<<1);// + bith; // can be with or without extra incoming bit

      // divide down
	new_stath=(shift_registerh & (1<<15))>>15; // so that is not just a simple divide down
	if (prev_stath==0 && new_stath==1) flipdh^=1;
	prev_stath=new_stath;	
	if (flipdh) GPIOC->BRR = 0b0010000000000000;  
	else GPIOC->BSRR = 0b0010000000000000;

	if (bith) GPIOC->BRR = 0b0100000000000000;   // this is top one!
	else GPIOC->BSRR = 0b0100000000000000;	
	
      sph= (((shift_registerh&(1<<7))>>7) + ((shift_registerh&(1<<15))>>14) + ((shift_registerh&(1<<23))>>21) + ((shift_registerh&(1<<31))>>28))<<7; // this one from test.c tested...
      sph=2360-sph; // try 312+1024=1336- 312+2048=2360
      //      sph+=312;
      TIM1->ARR =sph;
      TIM1->CCR1 = sph/2; // pulse width
      break;

    case 60: // TEST CASE FOR new ADC/DAC modes...
      // put say 4 or 8 bits in at intervals
      // ** SR with incoming bit
      // and DAC out is at later intervals
      bith = (shift_registerh>>31) & 0x01; // bit which would be shifted out

      // try for 4 bits in - at intervals of 32/4= 8 bits: 1, 8, 16, 24
      shift_registerh &= 0b11111110111111101111111011111110; // inverted mask: 0b11111110111111101111111011111110 LSB is at end
      // put the 4 bits in
      probh=(ADCBuffer[2]>>12); // 4 bits
      shift_registerh += ( ((probh&0x01)^(!(GPIOB->IDR & 0x0400))) + ((probh&0x02)<<7) + ((probh&0x04)<<14) + ((probh&0x08)<<21)); // would be 0 8-1 16-2 24-3

      shift_registerh=(shift_registerh<<1);// + bith; // can be with or without extra incoming bit
	// divide down
	new_stath=(shift_registerh & (1<<15))>>15; // so that is not just a simple divide down
	if (prev_stath==0 && new_stath==1) flipdh^=1;
	prev_stath=new_stath;	
	if (flipdh) GPIOC->BRR = 0b0010000000000000;  
	else GPIOC->BSRR = 0b0010000000000000;

	if (bith) GPIOC->BRR = 0b0100000000000000;   // this is top one!
	else GPIOC->BSRR = 0b0100000000000000;	
	
	  // no extract those 4 bits from the last slots bits 32, 24, 16 and 8, shift these and then << say 4 bits
	  //	  sph= (((shift_registerh&(1<<8))>>8) + ((shift_registerh&(1<<16))>>15) + ((shift_registerh&(1<<24))>>22) + ((shift_registerh&(1<<32))>>29))<<4;
      sph= (((shift_registerh&(1<<7))>>7) + ((shift_registerh&(1<<15))>>14) + ((shift_registerh&(1<<23))>>21) + ((shift_registerh&(1<<31))>>28))<<7; // this one from test.c tested...
      sph=2360-sph;
      TIM1->ARR =sph;
      TIM1->CCR1 = sph/2; // pulse width
      break;
      
    case 61: // TEST CASE FOR new ADC/DAC modes...      
      // let's try for 8 bits
      // check logic of this one after 3 bit shifts in test.c -> tested with one mistake fixed
      bith = (shift_registerh>>31) & 0x01; // bit which would be shifted out

      // try for 8 bits in at 3 bits intervals
      shift_registerh &= 0b11101110111011101110111011101110; // inverted mask: 0b11111110111111101111111011111110 LSB is at end
      // put the 8 bits in
      probh=(ADCBuffer[2]>>8); // 8 bits
      shift_registerh += (  ((probh&0x01)) + ((probh&0x02)<<3) + ((probh&0x04)<<6) + ((probh&0x08)<<9) + ((probh&0x10)<<12) + ((probh&0x20)<<15) + ((probh&0x40)<<18) + ((probh&0x80)<<21) );

      shift_registerh=(shift_registerh<<1);// + bith; // can be with or without extra incoming bit

      // divide down
	new_stath=(shift_registerh & (1<<15))>>15; // so that is not just a simple divide down
	if (prev_stath==0 && new_stath==1) flipdh^=1;
	prev_stath=new_stath;	
	if (flipdh) GPIOC->BRR = 0b0010000000000000;  
	else GPIOC->BSRR = 0b0010000000000000;

	if (bith) GPIOC->BRR = 0b0100000000000000;   // this is top one!
	else GPIOC->BSRR = 0b0100000000000000;	

      sph= (((shift_registerh&(1<<3))>>3) + ((shift_registerh&(1<<7))>>6) + ((shift_registerh&(1<<11))>>9) + ((shift_registerh&(1<<15))>>12) + ((shift_registerh&(1<<19))>>15) +((shift_registerh&(1<<23))>>18) +((shift_registerh&(1<<27))>>21) +((shift_registerh&(1<<31))>>24))<<4; // this one from test.c tested...
      sph=4408-sph; // 12 bits=4096+312=4408
      TIM1->ARR =sph;
      TIM1->CCR1 = sph/2; // pulse width
      break;

    case 62: // TEST CASE FOR new ADC/DAC modes...
      // try and use incoming bit to shift 4 bits in hstack - working now
	hcount++;
      // but can go over - max we want now is 27
	if (hcount>27) hcount=0;
	if( !(GPIOB->IDR & 0x0400)) {
	  hstack[3]=hstack[2];
	  hstack[2]=hstack[1];
	  hstack[1]=hstack[0];
	  hstack[0]=hcount+1; // bump it on to the hstack
	}	  
      
      bith = (shift_registerh>>31) & 0x01; // bit which would be shifted out

      // try for 4 bits in - at intervals of 32/4= 8 bits: 1, 8, 16, 24
      // we need a new mask
      //      shift_registerh &= 0b11111110111111101111111011111110; // inverted mask: 0b11111110111111101111111011111110 LSB is at end
      shift_registerh &= ~ (((0x01)<< hstack[0]) + ((0x02)<<hstack[1]) + ((0x04)<<hstack[2]) + ((0x08)<<hstack[3]));
      // put the 4 bits in
      probh=(ADCBuffer[2]>>12); // 4 bits
      shift_registerh += ( ((probh&0x01)<< hstack[0]) + ((probh&0x02)<<hstack[1]) + ((probh&0x04)<<hstack[2]) + ((probh&0x08)<<hstack[3])); // would be 0 8-1 16-2 24-3

