microresearch/allcolours/software/STM32F103/src/stm32f10x_it_DAC.c
      shift_registerh=(shift_registerh<<1) + bith; // leave this as bith

      // divide down
	new_stath=(shift_registerh & (1<<15))>>15; // so that is not just a simple divide down
	if (prev_stath==0 && new_stath==1) flipdh^=1;
	prev_stath=new_stath;	
	if (flipdh) GPIOC->BRR = 0b0010000000000000;  
	else GPIOC->BSRR = 0b0010000000000000;

	if (bith) GPIOC->BRR = 0b0100000000000000;   // this is top one!
	else GPIOC->BSRR = 0b0100000000000000;	
	
      sph= (((shift_registerh&(1<<7))>>7) + ((shift_registerh&(1<<15))>>14) + ((shift_registerh&(1<<23))>>21) + ((shift_registerh&(1<<31))>>28))<<7; // this one from test.c tested...
      sph=2360-sph;
      TIM1->ARR =sph;
      TIM1->CCR1 = sph/2; // pulse width
      break;
      
    case 63: // TEST CASE FOR new ADC/DAC modes...
	    // try and use incoming bit to shift 4 bits in hstack - working now
	    // same as above but now we do for the output bits - maybe not so interesting as just effects the DAC! seems oks!
	hcount++;
	if (hcount>16) hcount=0; // tweak this value...
	if( !(GPIOB->IDR & 0x0400)) {
	  hstack[3]=hstack[2];
	  hstack[2]=hstack[1];
	  hstack[1]=hstack[0];
	  hstack[0]=hcount+1; // bump it on to the hstack
	}	  
      
      bith = (shift_registerh>>31) & 0x01; // bit which would be shifted out

      // try for 4 bits in - at intervals of 32/4= 8 bits: 1, 8, 16, 24
      shift_registerh &= 0b11111110111111101111111011111110; // inverted mask: 0b11111110111111101111111011111110 LSB is at end
      // put the 4 bits in
      probh=(ADCBuffer[2]>>12); // 4 bits
      //      shift_registerh += ( ((probh&0x01)<< hstack[0]) + ((probh&0x02)<<hstack[1]) + ((probh&0x04)<<hstack[2]) + ((probh&0x08)<<hstack[3])); // would be 0 8-1 16-2 24-3
      shift_registerh += ( ((probh&0x01)) + ((probh&0x02)<<7) + ((probh&0x04)<<14) + ((probh&0x08)<<21)); // would be 0 8-1 16-2 24-3

      shift_registerh=(shift_registerh<<1) + bith;
	// divide down
	new_stath=(shift_registerh & (1<<15))>>15; // so that is not just a simple divide down
	if (prev_stath==0 && new_stath==1) flipdh^=1;
	prev_stath=new_stath;	
	if (flipdh) GPIOC->BRR = 0b0010000000000000;  
	else GPIOC->BSRR = 0b0010000000000000;

	if (bith) GPIOC->BRR = 0b0100000000000000;   // this is top one!
	else GPIOC->BSRR = 0b0100000000000000;	

      sph= ( (shift_registerh&(1<<hstack[0])) + (shift_registerh&(1<<hstack[1])) + (shift_registerh&(1<<hstack[2])) + (shift_registerh&(1<<hstack[3])) ); // this one from test.c tested... - or we space out a bit
      sph+=312;
      TIM1->ARR =sph;
      TIM1->CCR1 = sph/2; // pulse width
      break;
    }       /// end of HF modes
  }  
}

